{
    "Dumont Dunes OHV park": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32036-d5293396-Reviews-Dumont_Dunes_OHV_park-Baker_California.html"
        ],
        "contact": "+1 760-252-6000",
        "reviewComments": [
            "If you like off road ATV riding, then Dumont Dunes is a place to go. There are two areas. The large area with dunes as high as 700 feet, with an overall altitude of 1200 feet... read more"
        ],
        "longitude": "",
        "no_of_reviews": "6",
        "address": "Kel-Baker Rd , Baker , CA",
        "rank": "3",
        "youTubeIds": "v5mECsjzqoQ,wf6GFu9WOQQ,2FWSoGA6OkI"
    },
    "World's Tallest Thermometer": {
        "knownFor": "",
        "latitude": "35.2676303499285",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or170-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or50-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or150-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or60-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or140-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or130-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or70-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or110-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or120-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or160-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or80-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or100-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or90-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or40-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or30-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or20-World_s_Tallest_Thermometer-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d601345-Reviews-or10-World_s_Tallest_Thermometer-Baker_California.html"
        ],
        "contact": "760-733-4747",
        "reviewComments": [
            "We were driving from LA to Las Vegas, we stopped at Baker for lunch at A&W, and visited the tallest thermometer in the world. So glad we did it..",
            "The old fashioned sort of little roadside attraction one might associate with the 1950's. Good place to stop for gas between Las Vegas and :LA",
            "Worth a quick stop. Pay a visit to the gift shop as well. They were pretty friendly. Be sure to visit the Mad Greek while you're in this little town. They have the best... read more",
            "OK, so we stopped in Baker on 09/14/2013 because we were hungry and it was the first city once you get into CA from Nevada. We kept looking at this thing (structure?), not... read more",
            "Yeah, it's a beacon in the night, 2 am and it's 90 degrees. The restaurant is long gone, too bad as the burgers were good. Now it's a gift shop.",
            "I understand about 19 million people drive between Los Angeles and Las Vegas each year. Most would pass through Baker, and as they do, they would see this unusual sight- a tall... read more",
            "This was down sometime ago, but the thermometer is UP and running and accurate too. More of a drive-by and say \"WOW... it is the worlds tallest thermometer\" and keep going. But... read more",
            "I dont think it was worth the drive out of our wat to see it. First of all it is digital and was not working when we were there. The only good side was the BOBS BIG BOY ..",
            "The thermometer was broke for a long time. Too long. Baker is a armpit of a town and has few pluses. The thermometer and alien jerky are the only reasons to stop. When you drive... read more",
            "If you are close enough to see the thermometer, you gotta stop and get a good look at it! You don't even have to get out of your car!",
            "Sadly, this attraction is no longer in operation and the gift store is closed. As of our visit, the structure still stands and is good for a picture for the ol' scrap book. We had... read more",
            "Every time I've passed this place, I've thought, couldn't they do better? This is little more than a sign that tells you the temp outside. Sure there's a \"scale\" of ascending... read more",
            "Stopped by there last week on our way home from Utah. Has a nice store attached to it now, along with an outdoor eating area. Much cleaner & nicer than it used to be. A good... read more",
            "Quirky and convenient stop on the drive to Las Vegas. All a bit of fun while you grab something to eat and use the toilets.",
            "Thermometer is kind of cool. BUT the gas in Baker California was about $1.50 gallon higher than in Death Valley National Park.",
            "I do understand towns wanting to make themselves famous but creating something big. They do and this is The icon for Baker, California!",
            "Our kids had heard about the world's tallest thermometer from a friend, and were excited to see it on our drive toward Las Vegas. It's nothing special, but is a landmark as you... read more",
            "Well tick this one off the bucket list. Thing was until we arrived in Baker we never knew it existed. Now, well we've been there and done that. Kind a fun to say you've seen... read more"
        ],
        "longitude": "-116.071270766912",
        "no_of_reviews": "200",
        "address": "72155 Baker Blvd. , Baker , CA",
        "rank": "2",
        "youTubeIds": "GHaOnF2qb9w,gAuVvoeJ1Es,FHJel7vcE1Q"
    },
    "Alien Fresh Jerky": {
        "knownFor": "Gift & Specialty Shops , Shopping",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32036-d951390-Reviews-Alien_Fresh_Jerky-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d951390-Reviews-or20-Alien_Fresh_Jerky-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d951390-Reviews-or110-Alien_Fresh_Jerky-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d951390-Reviews-or50-Alien_Fresh_Jerky-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d951390-Reviews-or40-Alien_Fresh_Jerky-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d951390-Reviews-or90-Alien_Fresh_Jerky-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d951390-Reviews-or80-Alien_Fresh_Jerky-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d951390-Reviews-or60-Alien_Fresh_Jerky-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d951390-Reviews-or100-Alien_Fresh_Jerky-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d951390-Reviews-or70-Alien_Fresh_Jerky-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d951390-Reviews-or30-Alien_Fresh_Jerky-Baker_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32036-d951390-Reviews-or10-Alien_Fresh_Jerky-Baker_California.html"
        ],
        "contact": "1-877-ALIEN-35",
        "reviewComments": [
            "Great place to visit just for fun! The kids will love it as well. Staff is fun and always ready to help. Price for jerky is a little high but worth it!",
            "We couldn't help but stop here on our way through Baker, CA. The Alien motif was fun, and silly and the jerky was actually very tasty. Sadly we only got to pick up a few of the... read more",
            "Face it, there isn't much to do in Baker, how long can you possibly stare at a tall thermometer? Chances are if you are in Baker you are either on your way to or on your way back... read more",
            "Been coming here forever!!! NEVER have I missed an opportunity to NOT stop by on the way home or on the way up..... ALWAYS get gifts for friends and super hot jerky!!!",
            "Why stop an an AM/PM mini-mart for your Coca-Cola, when you can turn it into a cheeky photo opportunity? This place sells jerky in many different flavors and meats, but is... read more",
            "The jerky is a bit pricey, but it is a fun shop. A lot of Alien things, including three in a car at the front door. We bought the \"Road Kill Original\", and the clerk seemed... read more",
            "Okay, you're in the middle of BFE. There is NOTHING for miles but God forsaken desert. You're on your way to Vegas and cant wait, or you're very hungover and really have to pee... read more",
            "A very random, odd attraction, but I love the alien statues inside and out, and the jerky is great. Many flavors to choose from and if your into Alien swag this place is for you!",
            "I actually really like Baker, CA. It is a small one street town on the way to Adult Disneyland aka Las Vegas and you feel like you are driving Route 66 in the 50's. This little... read more",
            "If you have missed one of the 200 signs that tell you that you should stop I would be scared that you are the one driving. There is nothing else in Baker, CA that is a must see so... read more",
            "Funky place in a new building All kinds of jerky All kinds of hot sauces All kinds of candy and sodas Go behind the building and look at the dreams of an alien hotel... read more",
            "With a name like this you just have to stop and look! Aliens are everywhere and the gift shop has plenty of weird stuff to sell you. The best are the names given to the packages... read more"
        ],
        "longitude": "",
        "no_of_reviews": "134",
        "address": "Alien Fresh Jerky 72242 Baker Blvd. Baker, CA 92309 , Baker , CA 92309",
        "rank": "1",
        "youTubeIds": "4-jG07_lrFo,1V5Ckc7Oask,GkYTBOFmdLM"
    }
}