{
    "Catalina Express": {
        "knownFor": "Ferries , Transportation",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or180-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or50-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or40-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or30-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or20-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or10-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or160-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or150-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or60-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or170-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or140-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or70-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or120-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or110-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or80-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or100-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or90-Catalina_Express-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d1547894-Reviews-or130-Catalina_Express-Catalina_Island_California.html"
        ],
        "contact": "+1 800-481-3470",
        "reviewComments": [
            "Catalina Express really lives up to its name. It's a quick ride over to the island and they run very smoothly. I actually slept the whole way back. Open seating is easy but get... read more",
            "We took the Catalina Express from Long Beach to Avalon. It was about an hour ride. Nice large boat with tons of seats. Get there early if you want a window seat. Great service... read more",
            "Everyone on the ferry were very friendly and helpful. Easy ride from Long Beach to Catalina Island. Really enjoyed the experience!",
            "The boat is small enough to allow people to sit next to windows for a great view. It all seems well-organized and hospitable. We had a delicious local beer on board, which created... read more",
            "It's a about an hour boat ride to Catalina from Long Beach (another boat leaves from Newport). Comfortable seats, snacks and a bar onboard. $72rt pp. upgrade of $30 for VIP... read more",
            "This was my surprise for my birthday. We took the Catalina express to Avalon and my wife gut us the Commodore club. Which is seating on second deck inside. you get a free drink... read more",
            "Catalina is one of those great stay-cation destinations for Southern Californians. Exotic with beautiful vegetation and roaming buffalo in car-free small island vacation town... read more",
            "The ride to catalina island was very smooth, quick, and scenic. I would reccommend this ferry to anyone, old/young/groups/etc. It was clean, comfortable, timely and the staff... read more",
            "Fast trip to Catalina Island, about an hour's journey.... choose outdoor seating or inside seating.... either way is good. Outside will give you some good sun and sea spray... read more",
            "I've traveled in the Catalina Express several times over the last 7 years or so. Service has always been punctual. The boat is clean and comfortable. You can sit outside or... read more",
            "No one really knows why the song was written using \"26 miles\" but the truth is, the Island is only 22 miles from the mainland and the very best way to get there is on the Catalina... read more",
            "We thoroughly enjoyed our ferry ride to Catalina on 2/15. The views are beautiful, we loved watching San Diego fade into the background as we made the 22 mile journey to Catalina... read more",
            "This boat is very comfortable and staff are fun and courteous. There is food/drink available onboard. It is kid friendly and safety conscious. We took the trip from the port in... read more",
            "I did a spontaneous solo trip to Catalina for a zip lining excursion, and booked my tickets online for the Catalina shuttle. The regular seating was roomy, comfy, and plenty of... read more",
            "Its $7.00 each to bring it, and $10.00 or more to rent one. You'd rather have a bike here than not-if able to ride. City bike racks leave a lot to desire. We ranged from the... read more",
            "The whole experience was great. We were supposed to be on the 8:30 boat out to the island and arrive a little before an hour prior to our departure. The lady checking us in told... read more",
            "I took advantage of the \"ride free on your birthday\" promo. There was some confusion on whether or not the return trip had to also be on the birthday in order for it to be free... read more",
            "I had such a great day heading to Catalina Island. It started off with the Catalina Express - I was able to book my trip through the hotel concierge and then headed off to the... read more",
            "Fabulous, peaceful, journey to one of the premier day trips in America. Catalina Island is breathtaking. Short but nature embracing voyage. Went from Newport Beach. Took my... read more"
        ],
        "longitude": "",
        "no_of_reviews": "194",
        "address": "95 Berth , San Pedro (Admin Office) , Catalina Island, CA 90731-3384",
        "rank": "4",
        "youTubeIds": "NYJCQw6DSxo,Ssli0nDWVz0,6Vv3k_7EXqE"
    },
    "Trans-Catalina Trail": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g102873-d2209517-Reviews-Trans_Catalina_Trail-Catalina_Island_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g102873-d2209517-Reviews-or10-Trans_Catalina_Trail-Catalina_Island_California.html"
        ],
        "contact": "+1 310-510-2595",
        "reviewComments": [
            "Easy 37.2 mile trail across Catalina. This trail has fantastic vista views along a well planned out rolling path. Camping is situated every 8-10 miles. Plan a head and reserve... read more",
            "Lots of vertical. No water. Great views. No people. We just did a little part and then stuck to the road because I'm out of shape."
        ],
        "longitude": "",
        "no_of_reviews": "16",
        "address": "Renton Mine Road , Catalina Island, CA",
        "rank": "29",
        "youTubeIds": "dZd_UKxNG1M,aDbaQNI2riE,U849kwBeBX4"
    }
}