{
    "Leslie Jean Porter Gallery": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32186-d7333237-Reviews-Leslie_Jean_Porter_Gallery-Cathedral_City_California.html"
        ],
        "contact": "760 880 7139",
        "reviewComments": [
            "A Must destination, not easy to find so Google Leslie Jean Porter Gallery, but it is worth it. It is truly Bedazzling, a Wonderama for art collectors.A warm reception & ice tea.We... read more"
        ],
        "longitude": "",
        "no_of_reviews": "10",
        "address": "68-703 Perez Road , #A16 , Cathedral City , CA 92234",
        "rank": "4",
        "youTubeIds": "iA5AvlAOz0E,iDer3I8v3GE,8yRAK-VCG1o"
    },
    "Fountain of Life": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32186-d10110383-Reviews-Fountain_of_Life-Cathedral_City_California.html"
        ],
        "contact": "",
        "reviewComments": [
            "The water fountain that you can enjoy putting your feet into while your kids romp and play with others."
        ],
        "longitude": "",
        "no_of_reviews": "5",
        "address": "68700 Avenida Lalo Guerrero , In front of City Hall , Cathedral City , CA 92234-1208",
        "rank": "8",
        "youTubeIds": "oqt5EW7MKv4,Dsn7jeHafdA"
    },
    "Araby Trail": {
        "knownFor": "“ Nice hike with views ” Reviewed December 25, 2014 This trail takes you up by Bob Hope's house and above. You will have great views of the valley below. At the top the trail connects to others for a longer hike or you can go down the same path. The trail head is just off Southridge drive. You can park on the sand by the road which also has... More Helpful? 1 Thank victorian5 Report victorian5 has 1 more review of Araby Trail “Nice tune up hike” Reviewed January 22, 2016 Previous Next 1 2 Updating list... Travelers who viewed Araby Trail also viewed Fountain of Life 5 Reviews Cathedral City, California Desert Frank Sinatra Gravesite 28 Reviews Cathedral City, California Desert Desert Ice Castle 6 Reviews Cathedral City, California Desert Leslie Jean Porter Gallery 10 Reviews Cathedral City, California Desert All things to do in Cathedral City (22) Been to Araby Trail? Share your experiences! Write a Review Add Photos & Videos Questions & Answers Here's what previous visitors have asked, with answers from representatives of Araby Trail and other visitors 1 question Ask a question Questions? Get answers from Araby Trail staff and past visitors. Hi, what would you like to know about this attraction? Posting guidelines Get notified about new answers to your questions. Ask Typical questions asked: Will you pick up and drop off at my hotel? I have a family of 7. Can your tour accommodate all of us together? How should I dress for this tour? Near Araby Trail Top-rated Attractions Nearby 10 Reviews Leslie Jean Porter Gallery 6 Reviews Desert Ice Castle 5 Reviews Fountain of Life Browse all attractions Top-rated Restaurants Nearby 71 Reviews Tony' Burgers 205 Reviews Trilussa 180 Reviews Sunshine Cafe Browse all restaurants About Us | Site Map | Help Center © 2016 TripAdvisor LLC All rights reserved. TripAdvisor Terms of Use and Privacy Policy . * TripAdvisor LLC is not a booking agent and does not charge any service fees to users of our site... ( more ) TripAdvisor LLC is not responsible for content on external web sites. Taxes, fees not included for deals content.",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32186-d7360161-Reviews-Araby_Trail-Cathedral_City_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32186-d7360161-Reviews-or10-Araby_Trail-Cathedral_City_California.html"
        ],
        "contact": "",
        "reviewComments": [
            "Narrow, steep, winding trail, best hiked during morning hours. A hat, sunglasses and plenty of water are all necessities during hot days, as there is little to no shade. The... read more",
            ""
        ],
        "longitude": "",
        "no_of_reviews": "14",
        "address": "",
        "rank": "2",
        "youTubeIds": "bboYdMu_IH8,P6nDzNhOqms,LWcYcjdzduc"
    },
    "Desert Ice Castle": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32186-d5976040-Reviews-Desert_Ice_Castle-Cathedral_City_California.html"
        ],
        "contact": "+1 760-324-0400",
        "reviewComments": [
            "I went with a group of friends and tweens and we had a fantastic time. Plus, it is cooler inside than out."
        ],
        "longitude": "",
        "no_of_reviews": "6",
        "address": "68600 Perez Rd , Cathedral City , CA 92234-7216",
        "rank": "7",
        "youTubeIds": "f2veF5F4vu4,gS4W5H2yc50,GAgLWQpoDcs"
    },
    "Frank Sinatra Gravesite": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32186-d2279464-Reviews-Frank_Sinatra_Gravesite-Cathedral_City_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32186-d2279464-Reviews-or20-Frank_Sinatra_Gravesite-Cathedral_City_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32186-d2279464-Reviews-or10-Frank_Sinatra_Gravesite-Cathedral_City_California.html"
        ],
        "contact": "",
        "reviewComments": [
            "We stopped by for a visit to check out the Sinatra family gravesite. It was decorated with flags and flowers. Now far from Frank's site was the Gabor family gravesite. It was... read more",
            "Located in Desert Memorial Park (corner of Ramon & Da Vall,it's worth a visit,especially if you're a fan.Interesting that such a huge star should have such an ordinary... read more",
            "The graves of Frank Sinatra and other stars are located in the cemetery located on Ramon and Duvall in Cathedral City.Maps are located by the office and it is easy to find other... read more"
        ],
        "longitude": "",
        "no_of_reviews": "28",
        "address": "Desert Memorial Park , Cathedral City , CA",
        "rank": "1",
        "youTubeIds": "BC5yRkPUhfs,Tbmrun17jBU,CFKpzgbi5fE"
    },
    "Big League Dreams": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32186-d1573066-Reviews-Big_League_Dreams-Cathedral_City_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32186-d1573066-Reviews-or10-Big_League_Dreams-Cathedral_City_California.html"
        ],
        "contact": "+1 760-324-5600",
        "reviewComments": [
            "We visited while on a conference with 4 bus coaches full of people. The activities were fun and the baseball diamonds were great. Several different activities were arranged. Soft... read more",
            "The BLD in Cathedral city was great and the only downfall was that the smaller fields, DeMoines and Pawtucket did not have a building close enough to escape the heat and watch the... read more"
        ],
        "longitude": "",
        "no_of_reviews": "15",
        "address": "33700 Date Palm Dr , Cathedral City , CA 92234-4731",
        "rank": "5",
        "youTubeIds": "G7fvhbhoMJc,-sp1NxtS9Ps,IT_vN37cAU0"
    }
}