{
    "Seagrove Park": {
        "knownFor": "Nature & Parks",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2263366-Reviews-Seagrove_Park-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2263366-Reviews-or70-Seagrove_Park-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2263366-Reviews-or50-Seagrove_Park-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2263366-Reviews-or40-Seagrove_Park-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2263366-Reviews-or30-Seagrove_Park-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2263366-Reviews-or20-Seagrove_Park-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2263366-Reviews-or10-Seagrove_Park-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2263366-Reviews-or60-Seagrove_Park-Del_Mar_California.html"
        ],
        "contact": "+1 858-755-1524",
        "reviewComments": [
            "We stay next to this park in a time share. It is a terrific place to watch the sunset. Actually it is the best public place in Del Mar to watch the sunset. There are many events... read more",
            "Beautiful grassy area to picnic and enjoy the sunset. Children's playground nearby.",
            "Once you get used to the periodic commuter, Amtrack & freight trains that go by the park, it is very quiet with much grass and benches. You can eat a sandwich, take a nap, read... read more",
            "Calm and relaxing place with a nice view over the beach. Get your coffee and sit down during the morning is a great start.",
            "This os ultimate place for a family picnic. Play area for kids plus the ocean view! You can jump in the ocean if you like!",
            "It was very well done, If I could do it over again... but seriously where there isn't events here this is an other Delmar spot!",
            "If you are in Del Mar, a pleasant stroll to the beach will include a stop in Seagrove Park. A wedding destination for some, or a great place to watch the sunset or check out the... read more",
            "Located above Del Mar Beach with spectacular ocean views, Seagrove Park and adjoining Powerhouse Park are ideal grassy locations for a picnic or a wedding, walking a dog, catching... read more"
        ],
        "longitude": "",
        "no_of_reviews": "78",
        "address": "1601 Coast Blvd , Del Mar , CA 92014-2318",
        "rank": "4",
        "youTubeIds": "5xZOcyhryNc,256R2-pzsVI,d-rC_F4TwP8"
    },
    "Del Mar Race Track": {
        "knownFor": "Horse Tracks , Casinos & Gambling , Fun & Games",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or360-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or50-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or40-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or30-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or20-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or340-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or330-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or60-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or350-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or320-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or310-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or300-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or70-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or290-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or280-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or270-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or80-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or10-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or260-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or250-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or240-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or90-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or230-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or100-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or220-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or210-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or200-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or190-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or180-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or110-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or170-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or160-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or120-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or140-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or130-Del_Mar_Race_Track-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d209278-Reviews-or150-Del_Mar_Race_Track-Del_Mar_California.html"
        ],
        "contact": "+1 858-755-1141",
        "reviewComments": [
            "Just an enjoyable experience - good enough food - easy parking. Sat in the grandstand during the week so there were plenty of seats. My adult son's first time and he loved it.",
            "I've attended race meets both here & abroad, at tracks large & small, from Churchill Downs in Kentucky to a wee course in Wales, but the Del Mar Race Track remains my favorite. I... read more",
            "Very informative Good presenters Horse sales auctions and claiming Good way to get an idea about owning race horses Business aspects of of the backside",
            "We went there to support our friend, a Hall of Fame jockey, Mike Smith. With a bit of luck, we won on our first bet of the day. It was an awesome experience to watch the winning... read more",
            "The Del Mar Racetrack is a great place to go during the racing season (mid July to early September). They have a kids club right at the track. The kids play and then in between... read more",
            "Great place to spend the day with friends or family watching live horse racing. Beautiful facility built to resemble a old Sierra Mission with all the new modern amenities... read more",
            "I allowed my grandson to pick the horses and guess what he did better than me so now he wants to go again.",
            "What a fun afternoon! Lots of parking, great seating, big time racing and betting, and dining at all different levels. At times they will have a concert afterwards.",
            "Went to the Del Mar Fair and Racetrack for the first time in years. Admission was reasonable, parking pretty easy and well organized and the people there were haveing a great... read more",
            "A wonderful venue. Also the San Diego County Fair is held here every year!",
            "Glorious days at the track! Lovely Spanish decor, grandstand and clubhouse very easy to manage, offred free entry on Wednesday. Worth the drive up from San Diego.",
            "Classic racetrack in a beautiful setting. We spent a great day here with friends and even won some money. I think it's a little expensive just getting in considering parking... read more",
            "Have many activities here on every weekend year around from racing, shows, fairs, & many other competitions .",
            "Del Mar offers a full program of fast paced professional horse racing at a beautiful venue just off the beach in S. California on the edge of Solana Beach. The track is easily... read more",
            "Did not come for the horse races but for a Koi (fish) show. Awesome grounds and very friendly staff. Look forward to another event that I will be here for.",
            "Exciting; historical; enjoyable! Enjoyed lunch on the terrace; people watching and the gorgeous horses!",
            "Bet early as lines get long as races progress. We had box seats in the stretch area. Middle would have been better. Lots of food to be had and seat-side service is available but... read more",
            "Sheer Art Deco History Buffs, would love the aesthetic. Amazing views of the ocean from the grandstands. Very 1930's feel, beautiful track and an lover of beautiful horses can... read more",
            "WE bet every race. Came out even. So -- we really had a good time--did not lose a ;lot and really had a good meal too.",
            "The race track is fun whether you go all the time, or it's a one-time visit. Great people watching..you can make very small bets ($2) and still feel like a winner. Even if you... read more",
            "it's a beautiful track and the kids club is the greatest place ever! Children have to be between the ages of 5 and 12, both of my girls did not want to leave. it's only $45 for... read more",
            "What a great experience. Clean and well maintained. The area where you view the horses is just lovely with planted flowers and comfortable benches. On Wednesday, if you sign up at... read more",
            "This is a great little Racetrack. The location is as good as it gets, I mean you can walk across the street to the beach.The buildings are beautiful also, they have that Spanish... read more",
            "So much fun and crazy people watching experience !!! Everyone dresses up and drinks champagne like its the last day of the world. There are some great after parties after... read more",
            "If you are looking for a fun way to spend an afternoon, without draining your bank account (and perhaps evening adding to it), Del Mar provides the perfect opportunity. There is... read more",
            "The pretty ladies come dressed to the nines and the hats are amazing. Quite a crowd for Opening Day and worth going to again.",
            "A day at the races, especially in a reserved box seat is extremely pleasurable. I enjoyed the attentive service from our waitress. The menu is limited but what is served is... read more",
            "We love going to the horses, fun filled afternoon. You can get up close to the jockeys and horses. The paddock area is the great. Del Mar is very classy.",
            "Pay a little more and get into the upper decks where you can eat and have a vantage view of the races. Good atmosphere and good times can be had.",
            "One of America's most famous thoroughbred race tracks. A must visit. The new November meet has less traffic and is worth a visit.",
            "A beautiful horse racetrack near the beach in Southern California. I love to sit near the paddock area so that I can walk over there before each race to take a very close-up look... read more",
            "Great horse races makes for fun entertainment anywhere! live concerts on Friday nights are included with your ticket price. parking can be quiet the distance and fills up quick... read more",
            "I have gone to the Del Mar Race Track since I was a youngster. My aunt used to take me and she would give me a dime if she won a race. Del Mar Race Track is so beautiful... read more",
            "Very nice track. Clean everywhere. Nice people. Seats are very reasonable. Take a taxi or a shuttle. traffic and parking can be a problem. Prices even for drinks and food are 15... read more",
            "This is second year we have come here for Opening Day. We had a lot of fun, and the facility is in great shape. The area in the center of the track is especially nice. They... read more",
            "On Thursday, which is \"Singles day\", 5 ladies who travel in RV's had fun winning, losing & laughing at the races. One took the Amtrak down from Chatsworth and the rest met at the... read more",
            "We come out year after year for opening day. The staff is very friendly, the entire facility is very well kept, and the prices are about average for a what you get. Don't forget... read more"
        ],
        "longitude": "",
        "no_of_reviews": "374",
        "address": "just west of I-5 at the Via de la Valle exit , Del Mar , CA",
        "rank": "1",
        "youTubeIds": "XAxH1JG-9pY,dkFsj705ziE"
    },
    "Del Mar Farmers Market/Artisan Open Air Market": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2287237-Reviews-Del_Mar_Farmers_Market_Artisan_Open_Air_Market-Del_Mar_California.html"
        ],
        "contact": "+1 760-521-0643",
        "reviewComments": [
            "This market operates year-round from 1 to 4 p.m. on Saturdays. During our April visit, 41 canopied stands stood in a large area below the City Hall parking lot, selling everything... read more"
        ],
        "longitude": "",
        "no_of_reviews": "5",
        "address": "1050 Camino Del Mar , Del Mar , CA 92014-2604",
        "rank": "11",
        "youTubeIds": "IOSXunFPReU,2VXd2qc1T_8"
    },
    "Dog Beach": {
        "knownFor": "Beaches , Outdoor Activities , Nature & Parks",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or20-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or170-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or50-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or40-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or30-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or10-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or150-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or140-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or60-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or160-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or130-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or110-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or70-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or120-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or100-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or90-Dog_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d2642805-Reviews-or80-Dog_Beach-Del_Mar_California.html"
        ],
        "contact": "",
        "reviewComments": [
            "If you're a dog lover, you'll love strolling on dog beach where dogs can frolic to their hearts delight off-leash. There a couple of restaurants here as well (but not sure what... read more",
            "This is a beach that you share with dogs. The owners are very considerate (Mostly) and the sunsets here are spectacular to say the least. This is a wanderers paradise.",
            "Not far from my hotel is this lovely stretch of beach for two and four-legged friends. It was fun to stroll the shore and watch the dogs play in the surf. This is a family beach... read more",
            "The beach in Del Mar is gorgeous-could spend the whole vacation wondering along and people watching but we love dog beach-it's so wonderful to watch the dogs having so much fun in... read more",
            "Swimming with your dog in the ocean is one of my favorite things to do. This beach is perfect for dogs because its shallow on one side and then there is a long walking area. The... read more",
            "This is a great place to take your furry friends! We were lucky enough to find a FREE parking spot to the south, otherwise you have to pay and keep track of your time spent there... read more",
            "Great place for your dog to frolic in the surf. Most everyone who was there was mindful of their dogs behavior",
            "This is a very nice little beach, for people and dog watching. All the dogs seemed to get along with each other. The older ones just watched the younger ones play. One dog was... read more",
            "Dogs are good. Pacific Ocean, San Dieguito River mouth, and the beach in Del Mar all good. Most dog owners probably good, just a few bad apples sometimes.",
            "This is a nice beach to go with your doggies. It's shallow for quite a ways out so there's plenty of room to roam. There's plenty of doggie social opportunity, and of course... read more",
            "A little far to walk from parking to the actual shoreline but it blows away OB dog beach. You can watch a volleyball game and witch caring pet owners as well.",
            "Street parking is super easy to find on Camino Del Mar. There is both payed parking and free parking. When the tide is out the beach is extremely wide for the dogs to play but... read more",
            "During the winter you can take your dog off leash to this beach. It is a large area where people and canines can have fun. recently they had a dog surfing contest. Some of the... read more",
            "How nice it is to have a dog beach, it makes it a much easier vacation for us, & don't forget the Hilton Dan Diego Del Mar, just up the street!",
            "My dog has been going here since he had enough shots to be in public places! What a great happy way to have an hour or so with your favorite four legged friend. It is wonderful... read more",
            "I love hanging out with my dogs so being able to take them to dog beach is awesome, they run and play. Check rules, some times they need to be on a leach....all the dogs are... read more",
            "This place is pure heaven for dogs. It is a beautiful beach and if you go at low tide there is lots of beach to run and play on. Parking is the only pain. If you come during a... read more",
            "Dog Beach - Del Mar is a year round dog friendly beach located at the north end of Del Mar. Off leash months as well."
        ],
        "longitude": "",
        "no_of_reviews": "185",
        "address": "3006 Sandy Ln , Del Mar , CA 92014-2000",
        "rank": "3",
        "youTubeIds": "MUm6brG1vfs,jRAYpYSH5ag,19MLCHKjqvs"
    },
    "Powerhouse Park": {
        "knownFor": "Nature & Parks",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32286-d4302650-Reviews-Powerhouse_Park-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d4302650-Reviews-or50-Powerhouse_Park-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d4302650-Reviews-or40-Powerhouse_Park-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d4302650-Reviews-or30-Powerhouse_Park-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d4302650-Reviews-or20-Powerhouse_Park-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d4302650-Reviews-or10-Powerhouse_Park-Del_Mar_California.html"
        ],
        "contact": "+1 858-755-1524",
        "reviewComments": [
            "On the week-ends, parking is busy. Be prepared to walk to get to the park. Beautiful views and perfect picnic spot.",
            "Walked this park every evening to watch the sunset. Views were amazing. Park is beautifully maintained. Lovely to see so many people enjoying the outdoors. Can't wait to go back.",
            "Great place for a BBQ, picnic or a day at the beach. Well supervised for kids learning to surf or boogie board. Parking is a bit of a pain... but if you are creative you can... read more",
            "Fantastic beach!! Especially if you have kids. It's more of a local beach, so not as crowded as some of the more famous beaches. There is a large grassy area for dogs. There is... read more",
            "This a a narrow beach by Carribean or Gulf standards, about normal for this part of the world. Very close to Del Mar City beach, which is bigger. Lots of surfers in the morning... read more",
            "Great Views of the ocean . Wonderful place for couples , families or just about anyone . Food and drinks really close by ."
        ],
        "longitude": "",
        "no_of_reviews": "59",
        "address": "1600 Coast Blvd , Del Mar , CA 92014-2354",
        "rank": "5",
        "youTubeIds": "uNjRkTWNqrc,rMSJcIM8Vus,Ovf9uKOiARA"
    },
    "Jimmie O's": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32286-d4801900-Reviews-Jimmie_O_s-Del_Mar_California.html"
        ],
        "contact": "+1 858-350-3735",
        "reviewComments": [
            "As the only bar in Del Mar it was a fun almost dive bar. The drinks were strong and the staff was really cool. They also had food and their bison taco was amazing."
        ],
        "longitude": "",
        "no_of_reviews": "2",
        "address": "225 15th St , Del Mar , CA 92014-2304",
        "rank": "10",
        "youTubeIds": "ttc5ERk6MIo,gxPzv8Lc_nQ,6xh4IAd2XnA"
    },
    "Free Flight": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32286-d107752-Reviews-Free_Flight-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d107752-Reviews-or20-Free_Flight-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d107752-Reviews-or30-Free_Flight-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d107752-Reviews-or10-Free_Flight-Del_Mar_California.html"
        ],
        "contact": "+1 858-481-3148",
        "reviewComments": [
            "Great place to kill sometime with the little ones. Amazing beautiful birds--some are very friendly that allow you to pet and hold them. The manager their is great; she is... read more",
            "Free Flight is a home for birds who no longer have homes. The initial speech from the owner scared us and we were afraid of getting bit, but once we were there awhile and saw... read more",
            "Loved this place. For a nominal fee (which goes towards feeding the animals) you can enter Free Flight and visit with a variety of birds. There is a person who will explain to... read more",
            "I took the grandkids, ages 8 and 12, to this site. We absolutely enjoyed looking at the approximately 30 birds of varying species. as well as koi. There are many you are allowed... read more"
        ],
        "longitude": "",
        "no_of_reviews": "40",
        "address": "2132 Jimmy Durante Blvd , Del Mar , CA 92014-2215",
        "rank": "6",
        "youTubeIds": "67fpOi5i9mM,FmMDe25_Sqk,opC4-qycNhs"
    },
    "Del Mar City Beach": {
        "knownFor": "Beaches , Nature & Parks , Outdoor Activities",
        "latitude": "32.9678581",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or300-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or50-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or30-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or20-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or40-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or10-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or280-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or270-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or60-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or290-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or260-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or240-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or250-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or70-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or230-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or220-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or210-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or80-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or200-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or190-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or180-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or90-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or170-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or160-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or150-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or100-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or140-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or120-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or130-Del_Mar_City_Beach-Del_Mar_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32286-d208325-Reviews-or110-Del_Mar_City_Beach-Del_Mar_California.html"
        ],
        "contact": "+1 858-755-1556",
        "reviewComments": [
            "My favorite beach - once you can get there. Parking is difficult so get there early. Terrific restaurants nearby - Jake's Del Mar allows you to enjoy a meal and enjoy the beach... read more",
            "I attended a wedding at the Powerhouse Community Center in Del Mar. The facilities were on the beach and provided a beautiful venue for the wedding. Very nice.",
            "The beach exceeded our expectation. It was not crowded, which is huge plus in our books. There were occasional surfers to watch, a lifeguard on duty and plenty of dogs walking... read more",
            "Not as big as Coronado, but this beach had its own flavor- more of the locals, getting about enjoying their lives and having a great time, walking, swimming or playing... read more",
            "The beach was clean. Nice to have separate areas for games, etc. and just sunning. OK bathrooms. Beautiful sunsets. Great boogie boarding. Polite beach-goers.",
            "It's always fun to walk here; a bit north you run into dog beach and can enjoy seeing the dogs having fun in the water.",
            "Del Mar is the best. Scenic bustling but quiet. Great sunsets, great beach, great town, dog beach, restaurants, cliffs. No boardwalk to take away from the beauty but community... read more",
            "What a great experience. The beach, there's a grassy area and benches and a playground. Just lovely!!!",
            "What is not to like? Dog beach is smaller right now because of tides, but that is dynamic.",
            "It's not really a beach, it's rocks and pebbles. But really cool. Watch out for big waves that come out of the blue.",
            "This beach is my favorite \"walking\" beach. During low-tide, you can walk to Torrey Pines! This beach is best visited during the months of September-April/May--otherwise it is... read more",
            "My favorite beach in San Diego for its beauty and location near many fine restaurants and bars. Has a great green area and park for those that would rather park on the lawn. Great... read more",
            "Loved the beach!! We walked from the down town area of Del Mar and it was such a beautiful walk. The beach was not that busy as it was on a Thursday. But it felt really clean and... read more",
            "Visited in mid November, so was not crowed. We were able to park a couple blocks from the central area, which was nice. Beach was clean, with easy access, and well patrolled.",
            "Great place for a walk! Now I'm going on to Airbnb to see if we can rent one of the oceanfront houses ;-)",
            "Very nice and secluded. The beach is well cared for and very safe. We always have a good time there.",
            "We spent three days at the dog beach, met some great locals and got a good tan. Dog can't wait to go back for great swimming and socialization.",
            "We haven't found a bad beach yet in Southern California...this one was beautiful too. It was clean and active. It was interesting to see the amazing cliffs, clear ocean, and the... read more",
            "The first beach we went to was in Carlsbad. Our older grandchildren loved it because of the big breaker waves. It was fun to watch the surfers there. However, we wanted to go... read more",
            "The beach in Del Mar is worth a visit. Beach goers of all kinds, sun lovers, walkers, families, and surfers populate this beach. More lifeguards than most of the San Diego beaches... read more",
            "Beautiful beach & lifeguard on duty! Snack shop & restaurant available. A lot, a lot of kelp! Get her early to find parking without paying!",
            "Beautiful beach and sunset. Fun people watching. A little seaweed, might be seasonal. Ate at \"Jake's restaurant on the beach. Delcious!",
            "Went here for my second beach trip. Very nice beach, lots of dogs, so those that have a fear of dogs, be aware that this beach allows dogs and they are everywhere, I love dogs so... read more",
            "We love this beach. Very clean, convenient and safe beach for the family. Bathrooms are nice and right off the beach.",
            "Walk the beach in Del Mar during the winter. When the tide is right, you can easily walk from Jake's to Torrey Pines State beach and back. It is an invigorating experience... read more",
            "Del Mar City Beach is lovely and rocky! But, I guess that's what you get on the west coast. My daughter and I attempted to take a walk on the beach one night, but clouds were... read more",
            "We enjoyed our visit but it can get pretty crowded on the weekends. Be sure and bring your own food/drinks - there are no vendors on the beach. You can rent boards and chairs up... read more",
            "This is another great beach in Del Mar. Do go there while visiting Del Mar which is a really nice village in California about a half hour north of downtown San Diego. Del Mar is... read more",
            "It's challenging to get to the beach unless you enter from this park. The water is warm, lots of surfers and sunbathers, plus families with their tents, coolers, and footballs. A... read more",
            "We live in North County San Diego. This is our second year where our son who is now 8 was enrolled in camp at Fulcrum Surf in Del Mar - www.fulcrumsurf.com. This operation is A... read more",
            "Great beach. Plenty of sand. City bathrooms. grassy area adjacent to the sand for picnics and fun. Water was clean. It was lovely."
        ],
        "longitude": "-117.2676712",
        "no_of_reviews": "322",
        "address": "Coast Boulevard , Del Mar , CA",
        "rank": "2",
        "youTubeIds": "9d9N5e04jhc,98I_ST9GZSE,ne-wCezptGo"
    },
    "Magical Adventures": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32286-d1547165-Reviews-Magical_Adventures-Del_Mar_California.html"
        ],
        "contact": "+1 866-365-6987",
        "reviewComments": [
            "The Ballon ride for was a excellent experience and the owner is a try Ballon Enthusiast with his 22 years of experience he truly knows all the landmarks and the history of all... read more"
        ],
        "longitude": "",
        "no_of_reviews": "3",
        "address": "2707 Via de La Valle , Del Mar , CA 92014-1905",
        "rank": "8",
        "youTubeIds": "QZOjIjIrxXA,TI1H5i16Wf0,k_huLZPULZg"
    }
}