{
    "Shrine Drive-Through Tree": {
        "knownFor": "",
        "latitude": "40.2662524",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-or120-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-or110-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-or80-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-or60-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-or70-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-or100-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-or90-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-or50-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-or40-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-or30-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-or20-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32765-d106037-Reviews-or10-Shrine_Drive_Through_Tree-Myers_Flat_Humboldt_County_California.html"
        ],
        "contact": "",
        "reviewComments": [
            "This is an easy stop if you are doing the \"Avenue of the Giants\" drive through the redwoods. This is one of three drive-through trees. They are all private tourist attractions. To... read more",
            "Our family tries to be environmentally friendly, and going to this place seemed \"wrong\" to us, driving through a tree that had been harmed..... but I'm embarassed to say we did it... read more",
            "This poor tree is being held up by chains. We had to stop, I kept telling the kids we were going to drive thru a tree. There are also a couple of tree houses carved from redwoods... read more",
            "This is one of those classic things you have to do on a road trip. We drove through in a Chevrolet Equinox and fit through with a little breathing room. Don't forget to fold in... read more",
            "This is a cool thing to see. Its one of those things that you have to see at least once, especially if you are just in the area. There is usually a really long, slow moving line... read more",
            "It's one of those things you have to do, if you are around the Redwoods! We found this drive-through-tree during our drive of the Avenue of the Giants. It was $6 to drive... read more",
            "This is worth a stop if you are tired, and the kids are behaving. There are a few little things inside the compound to go along with the giant tree, but everything seems run down... read more",
            "A fun thing to do when in the area although a bit stressful when I put my large Nissan Armada SUV through the tree. The guy at the front said a Ford Expedition can go through but... read more",
            "It cost $5 for a car load. We drove through it. It was less than 5 minutes but it was something to check off our list.",
            "If you're in Redwood country, you've got to do it. Drive through a tree. It really was neat! Since it was slow that morning (we were the only ones there) we drove through, backed... read more",
            "It's just $6 to drive through the tree. There are a couple \"playhouses\" for the kids to play around in. Gift store was not open when we drove through.",
            "6 bucks to drive through a Redwood isn't too bad. It's a tight squeeze in an suv but after pulling in the mirrors I made it ok. The rest of the things in the park are geared... read more",
            "We pulled in and paid the fee. The attendant was very cordial and explained what all the attractions were. We drove through the tree, got pictures and then pulled up onto the... read more"
        ],
        "longitude": "-123.8703145",
        "no_of_reviews": "129",
        "address": "Myers Flat , CA",
        "rank": "1",
        "youTubeIds": "gGB9HYP_tnM,6U5ZSYZccYA,guw0cQM7HXs"
    }
}