{
    "Bravo Farms": {
        "knownFor": "Farmers Markets , Food & Drink , Shopping",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g33186-d1016258-Reviews-Bravo_Farms-Traver_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g33186-d1016258-Reviews-or110-Bravo_Farms-Traver_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g33186-d1016258-Reviews-or90-Bravo_Farms-Traver_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g33186-d1016258-Reviews-or80-Bravo_Farms-Traver_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g33186-d1016258-Reviews-or100-Bravo_Farms-Traver_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g33186-d1016258-Reviews-or70-Bravo_Farms-Traver_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g33186-d1016258-Reviews-or60-Bravo_Farms-Traver_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g33186-d1016258-Reviews-or50-Bravo_Farms-Traver_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g33186-d1016258-Reviews-or30-Bravo_Farms-Traver_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g33186-d1016258-Reviews-or40-Bravo_Farms-Traver_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g33186-d1016258-Reviews-or20-Bravo_Farms-Traver_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g33186-d1016258-Reviews-or10-Bravo_Farms-Traver_California.html"
        ],
        "contact": "+1 559-897-4634",
        "reviewComments": [
            "Old or young, you will love exploring this fun stop. Shop local goodies, watch cheese being made, eat lunch (food okay and not expensive) ice cream VERY good. Farm Animals, 7... read more",
            "I was headed from Bakersfield to Lake Tahoe, when I needed to pull off the road for lunch and a \"pit stop.\" Boy was I surprised. The food was great and the attractions many. I... read more",
            "Driving north on I-99, we needed a rest and were attracted by several well-placed (and readable while driving) signs. Bravo Farms is a fascinating hodge-podge of cafe, gift shop... read more",
            "Just an OK sandwich in my opinion. I didn't get excited over it, but I'd probably go there again. It's about the only option at the Tulare Outlets.",
            "This place is like a roadside fruit stand on steroids. It's a place to stop, rest, get some food, look at some souvenirs, and check out the local fruit. Not only do they have a... read more",
            "I have this a five for interesting - a shooting gallery, treehouse, cheese factory, unique gift bazaar, more antiques that you can look at, live animals ... Like I said... read more",
            "A \"spur of the moment\" visit. Been there several years ago, was surprised at all the changes. They have done a lot of work and added some nice antiques. Cheese and tourist... read more",
            "We saw the signs for Bravo Farms as we were driving into Fresno and decided we would stop on our way back home, and we are all glad we did. My family used to take long, boring... read more",
            "The store has all the variety of the farm products that are sold from nuts, cheese and meats. The display of all the historic signs and bill boards takes you back in time. A great... read more",
            "We stopped at this farmtique place. Inside, there were lots of food, beverage, and souvenirs to buy. Outside, there were lots of antique/vintage items to see. There was a 7-story... read more",
            "Great place to just stop and stretch along 99. Fun candy and a free sprinkles for your ice cream. The food looked great and smelled awesome!",
            "We were on our way to Sequoia National Park went a little bit out of the way to stretch our legs and have lunch glad we did enjoyed the atmosphere, the food, shops everthing about... read more"
        ],
        "longitude": "",
        "no_of_reviews": "116",
        "address": "36005 Hwy 99 , Traver , CA 93673",
        "rank": "1",
        "youTubeIds": "s5qWVS7NaYk,uCn9oS3uzWg,gqayyPiv1Jo"
    }
}