{
    "Indian Wells Golf Club": {
        "knownFor": "Golf Courses , Outdoor Activities",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32523-d611133-Reviews-Indian_Wells_Golf_Club-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d611133-Reviews-or90-Indian_Wells_Golf_Club-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d611133-Reviews-or50-Indian_Wells_Golf_Club-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d611133-Reviews-or40-Indian_Wells_Golf_Club-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d611133-Reviews-or30-Indian_Wells_Golf_Club-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d611133-Reviews-or20-Indian_Wells_Golf_Club-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d611133-Reviews-or10-Indian_Wells_Golf_Club-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d611133-Reviews-or70-Indian_Wells_Golf_Club-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d611133-Reviews-or60-Indian_Wells_Golf_Club-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d611133-Reviews-or80-Indian_Wells_Golf_Club-Indian_Wells_California.html"
        ],
        "contact": "+1 760-345-2561",
        "reviewComments": [
            "We are in town for several weeks and have already played six local golf courses. Everything about the golf experience here is outstanding. When we drove up to their... read more",
            "Played the Celebrity course at Indian Wells and it is my favorite course in Palm Springs. The layout is good, but the course does not require your game to be perfect and hit every... read more",
            "This really is a beautiful golf course. Perfectly maintained, and with good staff. Valet are helpful in unloading bags and organising Golf Buggies. We belong to an exclusive... read more",
            "Played in March. Golf course in great shape. Marshals friendly and helpful. Pace of play was not bad. Rented clubs from the Pro Shop. Clubs in good shape and can not be used... read more",
            "We were staying in Palm Desert and wanted to test a few golf courses, this was one very pretty course. There are homes weaving around the course and the manicured greens and... read more",
            "Players course. Brother-in-law and I were out and I was missing here, there, everywhere. Then, John came by in the food and beverage cart. He asked how the morning was going and I... read more",
            "Played the Cove Course...beautiful. What a marvelous day of golf. Course was in great condition; greens very fast. Pace of play was managed and we play din 3.75 hours. Definitely... read more",
            "Great golf. Course in fantastic condition, great staff and service. Would come back anytime and will definitely play here again whenever in palm springs!",
            "Beautiful setting, great condition. Slow play, though. Teed off at 1:00 pm, only finished 15 holes before too dark to play. Too bad.",
            "We played the celebrity course and it was so beautiful. It was very well kept and even when the shots weren't going my way it was hard to get mad b/c the scenary was amazing... read more"
        ],
        "longitude": "",
        "no_of_reviews": "100",
        "address": "46000 Club Dr , Indian Wells , CA 92210-8870",
        "rank": "2",
        "youTubeIds": "B_HSTBEQzKQ,X6nxeBzmGoU,4XNWpj-RmAQ"
    },
    "The Nest": {
        "knownFor": "Bars & Clubs , Nightlife",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32523-d2486258-Reviews-The_Nest-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d2486258-Reviews-or100-The_Nest-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d2486258-Reviews-or80-The_Nest-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d2486258-Reviews-or70-The_Nest-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d2486258-Reviews-or60-The_Nest-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d2486258-Reviews-or90-The_Nest-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d2486258-Reviews-or50-The_Nest-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d2486258-Reviews-or40-The_Nest-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d2486258-Reviews-or30-The_Nest-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d2486258-Reviews-or20-The_Nest-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d2486258-Reviews-or10-The_Nest-Indian_Wells_California.html"
        ],
        "contact": "+1 760-346-2314",
        "reviewComments": [
            "Interesting atmosphere: a mixture of modernity and times past, style and kitsch, family restaurant and... Some in my company found it depressive, others funny, though there was... read more",
            "It's a place with good food, and if your middle aged and single, the ladies are there to mingle!This has been a regular meeting place for years, but a kept secret!",
            "We were looking for a nice restaurant with some type of entertainment. We found it! Was there with my daughter and my 5 year old grand daughter. Not many children in the place... read more",
            "You can tell by the dynamic and the hugs that there are a lot of repeat clientele. The food is very good. They have an early bird special with lots of choices. That is very... read more",
            "Started off having a meal and although it was very tasty I felt the restaurant was looking very tired and needs a good face lift. Now the bar is something else. Live music was... read more",
            "Had a lovely meal during restaraunt week so the value was excellent Food very nice and staff really knew their job. The owner Dodi seemed to enjoy walking around welcoming... read more",
            "We were in Indian Wells checking out the swanky digs of a very successful college fraternity brother. He and his wife kept saying we would be entertained by their dinner place... read more",
            "We showed up at about 6pm on a friday nite....the owner was just getting ready to start singing. He was amazing sang some great dance songs and people started dancing...There are... read more",
            "Walked by this restaurant while visiting Indian Wells for the tennis tournament. The sign out front said voted top 100 restaurants in the US as voted on Yelp, so we decided to... read more",
            "this place is off the beaten path but it is a lot of fun small but well worth the trip always playing music very friendly.",
            "We had a great evening sitting in the bar and having dinner. The food was tasty and fresh, great value. The Nest has an \"old-time-y\" feel and great ambiance. We will return!"
        ],
        "longitude": "",
        "no_of_reviews": "113",
        "address": "75-188 California 111 , Indian Wells , CA 92210",
        "rank": "3",
        "youTubeIds": "3N0fd-CrOUA,YEwktScKl_0"
    },
    "Indian Wells Tennis Garden": {
        "knownFor": "Arenas & Stadiums , Concerts & Shows , Sights & Landmarks",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or280-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or50-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or260-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or250-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or270-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or60-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or40-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or220-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or240-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or230-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or20-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or30-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or70-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or10-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or210-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or200-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or190-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or80-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or170-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or160-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or180-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or90-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or130-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or140-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or150-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or100-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or110-Indian_Wells_Tennis_Garden-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d291280-Reviews-or120-Indian_Wells_Tennis_Garden-Indian_Wells_California.html"
        ],
        "contact": "+1 760-200-8400",
        "reviewComments": [
            "Both the food and the amenities are as good as the professional tournaments we have seen there over the years. It should be the fifth Grand Slam, but that hasn't happened yet... read more",
            "Very impressive courts, top notch, if you are a tennis fan get tickets.",
            "We love this tournament! Packing is easy. There are plenty of opportunities to get down low and see players play. It is really fun to see the players practice and be more up... read more",
            "well kept, good customer service, although will call could be improved",
            "If you love tennis you have to attend the Paribas Open. The venue is beautiful and it is fun to be able to get so close to the action.",
            "My partner and I splurged for an the club house seats and it was worth every penny. We met an older couple from Santa Barbara who could not have been more charming and delightful... read more",
            "The BNP Paribas Open is a fantastic experience. If you are a tennis fan, general sports fan, or just want to have a unique experience when visiting the CA desert in March, this... read more",
            "We just returned from our second visit to the Indian Wells Tennis Center for the BNP Paribus Open. It was just as wonderful again! No to say there isn't room for some improvement... read more",
            "If you love tennis then the March tournament is your cup of tea. It is considered another Major and deserves that title. Located in the beautiful community of Indian Wells, CA... read more",
            "With many practice courts and top pros at the tournament, its a great place to see pros up close. Stadium is big but with good views from all levels.",
            "I've only been now to three tourements - Canada Masters in Toronto ( multiple times), World Tour Finals in London (4 times) and this BNP Paribas Open once. We ( me and my husband... read more",
            "The hotel had a beautiful setting. Everyone was very friendly and helpful. Definitely recommend anyone staying there.",
            "Indian Wells/ BNP Paribas tournament is really incredible. Loved the venue, the facilities, restaurants, organization of the entire event. You get a close up of the players... read more",
            "The Indian Wells Tennis Garden is amazing and has so much to offer tennis fans from around the world. The practice courts are easily accessible to the fans and it is delightful... read more",
            "Indian Wells Tennis Garden and BNP Paribas Open is the best tennis tournament in the land. Larry Ellison and management team continue improve the grounds and offerings. The venue... read more",
            "I received free tickets to the John McEnroe charity classic and figured why not. I was not a tennis fan when I entered, but was when I left. This venue is spotless! It is brand... read more",
            "The new stadium is beautiful! The venue is clean,beautiful and well organized. Well done Mr. Ellison!!",
            "Loved the 2nd biggest stadium in the world and organisation for the tournament is fantastic but the new Chop House restaurant is very very expensive. I did not try the other 2 new... read more",
            "We have been going to the Pro tour event in March here at Indian Wells for 15 years . We miss one occasionally but if we are in Palm Springs area we try to attend several rounds... read more",
            "just did a walk around and was quite impressed with the facility and checked out little shop which had great stuff",
            "I've attended this tournament half a dozen times and look forward to going again. It's the ultimate treat for real fans of the game in the US.",
            "We watched the final day of play at the BNP Paribas Open. It was the first time we had been to a pro tournament. It was very hot, but we had seats in the shade, as we bought... read more",
            "I have been to grand slams at Wimbledon and Flushing Meadows and this venue is every bit as good as those - probably better! Great weather, nice envrionment and easy to get from... read more",
            "You do not even have to like tennis. My husband does and I don't. But the grounds are beautiful, the shopping fun, the various restaurants have multiple choices, and the players... read more",
            "The venue itself is wonderful. There are about 20 practice courts; where patrons are able to watch all their favorites warm up and the crowds are minimal. Then there are about... read more",
            "Spectacular facility. All courts during wta and apt event have review systems. Grounds are beautiful and comfortable especially when you consider the very large crowds. Everything... read more",
            "Everything about it is a great experience. Not a Tennis fan, it wont make a difference! It is a great place to visit and experience. Love, love this time of year. EVERYONE is... read more",
            "We visited the Indian Wells Tennis Garden during the PNB Parribas tennis tournament several weeks ago, even though we are not tennis fans. This venue is absolutely beautiful and... read more",
            "Warm, dry desert air; clear sunny blue skies; mountains seemingly within touching distance; state of the art courts and facilities; easy access and ample free parking (except... read more"
        ],
        "longitude": "",
        "no_of_reviews": "300",
        "address": "78200 Miles Ave , Indian Wells , CA 92210-6803",
        "rank": "1",
        "youTubeIds": "fZjKMvPEzaQ,y9wn9QQWtQ0,C5ePslBQ9Bg"
    },
    "Indian Wells": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32523-d8820258-Reviews-Indian_Wells-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d8820258-Reviews-or20-Indian_Wells-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d8820258-Reviews-or10-Indian_Wells-Indian_Wells_California.html"
        ],
        "contact": "",
        "reviewComments": [
            "The first time we went we did in the middle of the first week. This time we went the first three days. The first two days were free but that was not the good part. The good part... read more",
            "Just returned from the Indian Wells tennis tournament. . .great tennis, very relaxed atmosphere. Loved that we were able to bring in our own drinks (as long as it is not in a... read more",
            "My wife and I went to Indian Wells for the first time in March to attend day matches at the BNP Paribas tennis tournament and they were great. Almost all of the reviews for the... read more"
        ],
        "longitude": "",
        "no_of_reviews": "26",
        "address": "78200 Miles Ave , Indian Wells , CA 92210-6803",
        "rank": "6",
        "youTubeIds": "h5sBPyW-gT8,k3dge32voeE,D7jO-9mcfU4"
    },
    "Toscana Country Club": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32523-d1915757-Reviews-Toscana_Country_Club-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d1915757-Reviews-or10-Toscana_Country_Club-Indian_Wells_California.html"
        ],
        "contact": "+1 760-772-7000",
        "reviewComments": [
            "I had the good fortune recently to be invited to a client meeting in Indian Wells at his Country Club home in TOSCANA. Having lived in Palm Desert for several years I am familiar... read more",
            "Toscana CC is a beatiful country club. I played in a PGA event the week of October 4th. It is the National Senior Club Pro Tournament. Toscana is the perfect place to host this... read more"
        ],
        "longitude": "",
        "no_of_reviews": "11",
        "address": "76009 Via Club Villa , Eldorado Drive and Fred Waring Drive , Indian Wells , CA 92210",
        "rank": "8",
        "youTubeIds": "57ey6FR12XA,V9q2fLrMuL0"
    },
    "Fantasy Balloon Flights": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32523-d3641995-Reviews-Fantasy_Balloon_Flights-Indian_Wells_California.html"
        ],
        "contact": "+1 760-568-0997",
        "reviewComments": [
            "My group of 6 had a great time doing this hot air balloon ride. The guide & owner, Steve Wilkinson, was nice & informative. We met him at a restaurant, filled out paperwork... read more"
        ],
        "longitude": "",
        "no_of_reviews": "3",
        "address": "74901 US Highway 111 , Indian Wells , CA 92210-7134",
        "rank": "9",
        "youTubeIds": "7IUna6I-Tg4,wSh64-weRCM,GtjV-iotiu4"
    },
    "Indian Wells Golf Resort": {
        "knownFor": "Golf Courses , Outdoor Activities",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32523-d278608-Reviews-Indian_Wells_Golf_Resort-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d278608-Reviews-or90-Indian_Wells_Golf_Resort-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d278608-Reviews-or70-Indian_Wells_Golf_Resort-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d278608-Reviews-or60-Indian_Wells_Golf_Resort-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d278608-Reviews-or80-Indian_Wells_Golf_Resort-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d278608-Reviews-or50-Indian_Wells_Golf_Resort-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d278608-Reviews-or40-Indian_Wells_Golf_Resort-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d278608-Reviews-or30-Indian_Wells_Golf_Resort-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d278608-Reviews-or20-Indian_Wells_Golf_Resort-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d278608-Reviews-or10-Indian_Wells_Golf_Resort-Indian_Wells_California.html"
        ],
        "contact": "+1 760-346-4653",
        "reviewComments": [
            "Our top end course to play in Palm Springs area, we chose Indian Wells due to the Big Break from the Golf Channel. Our 4 some partner that coordinated our 5 days of golf called... read more",
            "Fantastic day at the Golf Resort at Indian Wells. Came out from LA for the weekend. The greens were beatiful and the weather was sunny. Fantastic views of mountains. Carts hjad... read more",
            "Played both the Celebrity and Players courses at this resort. Different character entirely: Players course aims to look almost high-desert, with pine trees dominating the... read more",
            "Let's start with the facility....excellent! The Club House is beautiful complete with a concierge service. The Pro Shop is to die for and non golfers will enjoy shopping here... read more",
            "Interesting course, very well maintained, nice staff in pro shop, restaurant and on course.",
            "I have ever been in. Pro shop extensive with the one of the largest selections of merchandise I have seen. The clubhouse and outside patio are huge with a decent restaurant. Both... read more",
            "I don't play golf, but I wanted to review this golf course because it was so beautiful. I went with my boyfriend while he played and we were on the \"players\" course. It has some... read more",
            "Played the Celebrity course and from the moment I arrived it was outstanding. The clubhouse, pro shop, cart and first tee staff were excellent. I was very impressed with the... read more",
            "With the very hot weather during early September the Golf Resort has some great value packages for the hardy. With plenty of liquid refreshment, ice towels, helpful cloud cover... read more",
            "We played both courses. Several members of our group are do not play very often but found they could get around without too much difficulty. Their staff, especially the starters... read more"
        ],
        "longitude": "",
        "no_of_reviews": "94",
        "address": "44500 Indian Wells Ln , Indian Wells , CA 92210-8746",
        "rank": "4",
        "youTubeIds": "B_HSTBEQzKQ,X6nxeBzmGoU,hP3Z3EQmAZ8"
    },
    "Spa Esmeralda": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32523-d269123-Reviews-Spa_Esmeralda-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d269123-Reviews-or20-Spa_Esmeralda-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d269123-Reviews-or10-Spa_Esmeralda-Indian_Wells_California.html"
        ],
        "contact": "+1 800-467-4209",
        "reviewComments": [
            "Very professionally run spa within the Renaissance Hotel. My therapist, Patricia, was great. She explained the procedures, asked about clinical conditions then provided to give... read more",
            "My Wife and I both had separate Couple's massages, then met outside in the beautiful Garden and enjoyed the hot tubs and scenery. First Rate!",
            "The spa is professionally run, has experienced staff that know their work and are attuned to their clients. I much recommend Patrick for outstanding reflexology and body work... read more"
        ],
        "longitude": "",
        "no_of_reviews": "27",
        "address": "44400 Indian Wells Ln , Renaissance Esmeralda Resort & Spa , Indian Wells , CA 92210-8708",
        "rank": "7",
        "youTubeIds": "u4W74lZLtU0,rvmkbOgKFw0,PU3fs0skTOM"
    },
    "Aqua Serena Spa": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32523-d4083665-Reviews-Aqua_Serena_Spa-Indian_Wells_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32523-d4083665-Reviews-or10-Aqua_Serena_Spa-Indian_Wells_California.html"
        ],
        "contact": "+1 760-341-1000",
        "reviewComments": [
            "I would like to spend the day there with spa treatments ! I will be telling all when I get reflexology and spend the day ! Stay tune !",
            "Visited the Aqua Serena Spa today to get my haircut and to possibly get a deep tissue massage. I didn't have an appointment for the massage and I must say, Chelsea at the front... read more"
        ],
        "longitude": "",
        "no_of_reviews": "19",
        "address": "44600 Indian Wells Ln , Hyatt Regency Indian Wells Resort & Spa , Indian Wells , CA 92210-8707",
        "rank": "5",
        "youTubeIds": "CbZlSPp7S8k,D9oWrxRrBPE,_l2ytOrBnWE"
    }
}