{
    "Tributary Whitewater Tours - South Fork American River Rafting": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32663-d2615519-Reviews-Tributary_Whitewater_Tours_South_Fork_American_River_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d2615519-Reviews-or40-Tributary_Whitewater_Tours_South_Fork_American_River_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d2615519-Reviews-or30-Tributary_Whitewater_Tours_South_Fork_American_River_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d2615519-Reviews-or20-Tributary_Whitewater_Tours_South_Fork_American_River_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d2615519-Reviews-or10-Tributary_Whitewater_Tours_South_Fork_American_River_Rafting-Lotus_California.html"
        ],
        "contact": "+1 800-672-3846",
        "reviewComments": [
            "We spent Friday night and Saturday night in their camp site which was awesome! We did the afternoon half day category 2/3 trip. We were a group of 7, two families, and... read more",
            "My husband, two teenagers and I took the 1-day Gorge Run trip on the South Fork of the American River. Tributary gave us a wonderful first rafting experience. Our guide Jon was... read more",
            "My friend and I at 65 years young had never done this before, we had a BLAST! We went on the level 2 & 3 , now ready for more. We had wonderful guide named Dave and the driver... read more",
            "Rafting the American River with Cody was a blast. We had a few first-timers in our group and the three hour tour was the perfect experience for them. We rafted down the river... read more",
            "I've spend with them 24h last weekend - starting with delicious dinner at the fireplace followed by a good sleep on their campground. Next day started with the best breakfast I... read more"
        ],
        "longitude": "",
        "no_of_reviews": "43",
        "address": "6400 Highway 49 , Lotus , CA 95651",
        "rank": "6",
        "youTubeIds": "IjKWgD0y4rc,jymlHfekp1k"
    },
    "Rock-N-Water Christian Camps": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32663-d2196771-Reviews-Rock_N_Water_Christian_Camps-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d2196771-Reviews-or50-Rock_N_Water_Christian_Camps-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d2196771-Reviews-or40-Rock_N_Water_Christian_Camps-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d2196771-Reviews-or30-Rock_N_Water_Christian_Camps-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d2196771-Reviews-or20-Rock_N_Water_Christian_Camps-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d2196771-Reviews-or10-Rock_N_Water_Christian_Camps-Lotus_California.html"
        ],
        "contact": "+1 800-738-0555",
        "reviewComments": [
            "It was awesome, - and then some. Folks and food were great ... and we just loved \"running around\" and seeing/doing all we could! Next summer!!",
            "Our trip was in 2009 (not an available date) and my kids have attended both before and since with our church youth groups. Every visit to RNW has brought home stories of... read more",
            "Rock-N-Water's camp is beautiful. It is right on the water. The rafting trips were wild!. I loved the staff and the food was awesome. They make a killer salsa. I recommend wearing... read more",
            "We were very impressed with the Gold Country trip that Rock and Water put on for our 4th Grade class. First rate people who genuinely care about both learning and Christ... read more",
            "Going to rock was a totally awesome experience. It caters to people of all ages (Probably because it's Gods creation). Hello I'm Debbie, and I'm 20. I went to Rock-N-Water with a... read more",
            "My son has done this several years with his youth group and they love it. They do rafting, rock climbing and canyoneering. They go as a group and come home exhausted."
        ],
        "longitude": "",
        "no_of_reviews": "59",
        "address": "6580 State Highway 49 , Lotus , CA 95651-9755",
        "rank": "5",
        "youTubeIds": "zN_IsA32bLU,kpI2egfJTXY"
    },
    "Mother Lode River Center": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1837428-Reviews-Mother_Lode_River_Center-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1837428-Reviews-or40-Mother_Lode_River_Center-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1837428-Reviews-or30-Mother_Lode_River_Center-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1837428-Reviews-or20-Mother_Lode_River_Center-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1837428-Reviews-or10-Mother_Lode_River_Center-Lotus_California.html"
        ],
        "contact": "+1 530-626-4187",
        "reviewComments": [
            "We just got back after spending two nights camping at the Mother Lode. The Camp ground is very nice. We did the Ropes Coarse and Rafted one day. Our Guides for the ropes coarse... read more",
            "Great day rafting trip for novice, mild thrill seekers and younger children! Remember to reapply sunscreen even when having fun. Remember to drink water as well- the... read more",
            "We spent a day at the River Center with a large group of people with a wide range of prior experiences. The staff were great in making all feel safe while helping us push up... read more",
            "My family of four (including two 8-year-old girls) purchased a deal through TravelZoo, which we learned about when contacting MaLode to make a reservation. The staff here is... read more",
            "Cassandra guided us through the gorge on the American River. My daughter and wife have never gone rafting, so this was a perfect trip for us. It was beautiful and thrilling. I... read more"
        ],
        "longitude": "",
        "no_of_reviews": "45",
        "address": "6280 State Highway 49 , Lotus , CA 95651-9704",
        "rank": "7",
        "youTubeIds": "EDRuAVcpw3Y,0XAbYAW9YhM"
    },
    "Beyond Limits Adventures - Day Trips": {
        "knownFor": "River Rafting & Tubing , Outdoor Activities , Tours , Boat Tours & Water Sports",
        "latitude": "38.8074581709232",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-or20-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-or190-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-or50-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-or40-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-or30-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-or170-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-or60-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-or160-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-or150-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-or130-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-or110-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1607152-Reviews-or100-Beyond_Limits_Adventures_Day_Trips-Lotus_California.html"
        ],
        "contact": "+1 800-234-7238",
        "reviewComments": [
            "",
            "Chris was our guide, and he was absolutely awesome! He was very informative and had a great sense of humor. He also choreographed the ride to make sure we had a lot of fun! Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Reviewed August 10, 2016 clanaer , Plano, Texas Add Photo Write a Review 192 Reviews from our TripAdvisor Community Which Lotus hotels are on sale? mm/dd/yyyy mm/dd/yyyy See hotels Sponsored links * See what travelers are saying: Traveler rating Excellent (177) Very good (14) Average (1) Poor (0) Terrible (0) Traveler type Families (86) Couples (12) Solo (1) Business (6) Friends (74) Time of year Mar-May (10) Jun-Aug (163) Sep-Nov (17) Dec-Feb (2) Language All languages English (192) Showing 192: English reviews Clear all clanaer Plano, Texas 1 review “ Awesome Experience! ” Reviewed August 10, 2016 Chris was our guide, and he was absolutely awesome! He was very informative and had a great sense of humor. He also choreographed the ride to make sure we had a lot of fun! Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank clanaer Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review We are glad you enjoyed Chris as much as we do! Thank you for the trip review! More Joy T Los Altos, California 1 review “ Rafting with friends and family ” Reviewed August 10, 2016 Chris was a wonderful guide. He was fun and entertaining! We enjoyed the trip very much and will do it again. Thank you! Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank Joy T Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your trip review! We look forward to seeing you again! More fonebiz55 Edison, New Jersey Level Contributor 10 reviews 3 attraction reviews 1 helpful vote “ Great Time on American River!! ” Reviewed August 10, 2016 This was our third trip over the years with Beyond Limits Adventures. We took the Upper Chili Bar Express on the American River tour. It was incredible!! We always really enjoy our White Water Rafting Trips. They are always the highlight of our vacation to Central California!! Water was great and not too cold and too much fun was had... More Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank fonebiz55 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for choosing to raft with Beyond Limits again! We love being a repeat stop on your California vacations! More peggyf511 Benicia, California 1 review “ Exceptional experience for our family! ” Reviewed August 10, 2016 What an incredible day! Sometimes it's challenging finding a family activity that has high interest for all ages. Our kids are 13, 17 and 20 and I haven't seen them laughing so hard all summer. Mike, owner of the company, was our guide down the river. He shared stories, history of the area and skill in surfing the rapids and... More Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank peggyf511 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your trip review! I was glad to guide your family down the river, and it was really great getting to know you. We hope to see you again on the river! More cmmulhall CONCORD 1 review “ Great trip! ” Reviewed August 9, 2016 Everyone was friendly and fun. It was an awesome trip! Well worth it. We will definitely be going again. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank cmmulhall Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review We look forward to your next trip! Thank you for the review! More svogt82 San Francisco, California Level Contributor 6 reviews 1 helpful vote “ Awesome day on the river ” Reviewed August 9, 2016 We had an awesome day on the river. Our guide was Wiggy and she was wonderful! Can only highly recommend this experience!! Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank svogt82 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your trip review! We hope to see your group again soon! More Ashish S Danville, California 1 review “ White water rafting for beginners... Amazing! ” Reviewed August 9, 2016 Highly recommend our guide Fletch. He made our trip unique and highly memorable. He is something else ;) Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank Ashish S Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your trip review! We are glad that you had a fun trip with Fletch! More Phil S Auburn, California 2 reviews 1 helpful vote “ Best time ever on the river ” Reviewed August 9, 2016 This trip was the best time I've ever had on the river. Our guide Fletch was so good. He is funny, talkative, and very professional. He allowed us to dictate how crazy we got on the river and yet kept us all very safe the entire way. So much fun. I look forward to going with Beyond again. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank Phil S Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thanks for the review! We love hearing about your fun day on the water. Come visit us again soon! More lmcrawfe Davis, California 1 review “ Excellent guide, excellent time ” Reviewed August 9, 2016 My friends and I (all mid 20's) had an amazing time on this trip. Our guide Gabriel was very funny, friendly and skilled. The rapids were fun and exciting, without ever being too intense. And the hot dog buffet at the end was an added bonus. We would definitely come again! Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank lmcrawfe Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for choosig Beyond Limits and thank you for your trip review! We hope to see your group again next season! More Sanvie California Level Contributor 31 reviews 10 attraction reviews 25 helpful votes “ Everything you ask for! ” Reviewed August 9, 2016 We spent a fantastic day with Chris, our guide. He put all 9 of us in one boat which made it so much more fun. No helmets required for them- loved that. He made us laugh throughout as well as laughing with us and at us- perfect match for our crew. Lunch afterward and bus back to our cars was... More",
            "Rafting on the American River is major fun! Be sure to know how to swim and follow your guides instructions. The water is always cold...but in the middle of summer, it's welcomed.",
            "First time rafting. The guide was very knowledgeable and gave clear instructions on what to expect and what to do. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Reviewed July 19, 2016 esmay465 , Castaic, California Add Photo Write a Review 192 Reviews from our TripAdvisor Community Which Lotus hotels are on sale? mm/dd/yyyy mm/dd/yyyy See hotels Sponsored links * See what travelers are saying: Traveler rating Excellent (177) Very good (14) Average (1) Poor (0) Terrible (0) Traveler type Families (86) Couples (12) Solo (1) Business (6) Friends (74) Time of year Mar-May (10) Jun-Aug (163) Sep-Nov (17) Dec-Feb (2) Language All languages English (192) Showing 192: English reviews Clear all esmay465 Castaic, California 1 review “ Rafting with friends ” Reviewed July 19, 2016 First time rafting. The guide was very knowledgeable and gave clear instructions on what to expect and what to do. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank esmay465 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for choosing Beyond Limits! We are glad you chose the best for your first trip! Come see us again soon :) More reems1220 Dublin, California 1 review “ Perfect day trip!! ” Reviewed July 19, 2016 Beautiful, fun and exciting trip! It was great experience with kids, the guide was knowledgable and helpful in keeping us safe and having fun. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank reems1220 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review We are glad you had a safe and fun trip! We hope to see you again soon! More marissamooney Bakersfield 1 review “ Amazing day on the river! ” Reviewed July 19, 2016 The staff was funny and super knowlegeable. We had a big group and we were all well taken care of. It was definitely the highlight of our trip. Even Grandma loved it! Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank marissamooney Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your trip review! We are glad that Grandma enjoyed the trip as well! More timcL6715BO El Dorado Hills, California 2 reviews “ Great Trip on the American!! ” Reviewed July 19, 2016 Kids and adults had a blast! Worth every penny. We are already planning on doing this every year if we can. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank timcL6715BO Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your review! We hope to see you again soon! More tbnelson Dana Point, California 1 review “ Beyond Limits Adventures ” Reviewed July 19, 2016 Our guide Don was hilarious. He made the trip very enjoyable! He was able to tailor our trip in order to reach our full expectation! Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank tbnelson Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for rafting with us! We love having Don as one of our guides and are glad you enjoyed him as well! More kirkshannon Roseville, California 1 review “ Team Gabriel rocks! ” Reviewed July 15, 2016 My wife and I had a blast on the south fork. Our rafting guide Gabriel, provided us with fun facts about the area whenever we hit calm sections of the river. We plan to come back again but this time it will be for a two day trip. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank kirkshannon Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for choosing Beyond Limits! We hope to see you again soon! More erikg601 San Jose, California 1 review “ River rafting ” Reviewed July 14, 2016 They had Friendly guides and I had a hell of an experience. Would go back to do it again and recommend it. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank erikg601 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review We are glad you had a fun time on the river! Come back again and visit us! More aceman390 Mill Valley, California 1 review “ Best family time imaginable - rafting the American River ” Reviewed July 13, 2016 I'm a dad and have been taking my girls up there since they were little - we still love it! Beyond Limits has a crew a very professional guides, they keep it fun (and safe) and just everything about the whole experience makes for some wonderful memories... it's just such a blast I can't imagine anyone not having a good... More Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank aceman390 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Hi Mark- Thank you for your review! We are glad that your family came to raft and camp with us, and we look forward to your next trip! More Mikal H El Dorado Hills, California Level Contributor 2 reviews 1 helpful vote “ Outstanding float down down the American River! ” Reviewed July 13, 2016 We had a wonderful morning floating down the American River with Beyond Limits. The float trip went from Chilli Bar in Placerville down to Coloma where they provided us lunch after the float. We have been on several float trips across the US, but this was our first on the American River although it is in our backyard. We had... More",
            "",
            "Our group wasn't sure what we were getting ourselves into, and we're bit nervous at first. However, by the time ergot through the first rapid we were excited! The guides are... read more Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Reviewed August 9, 2016 nadia586 , San Francisco, California Add Photo Write a Review 192 Reviews from our TripAdvisor Community Which Lotus hotels are on sale? mm/dd/yyyy mm/dd/yyyy See hotels Sponsored links * See what travelers are saying: Traveler rating Excellent (177) Very good (14) Average (1) Poor (0) Terrible (0) Traveler type Families (86) Couples (12) Solo (1) Business (6) Friends (74) Time of year Mar-May (10) Jun-Aug (163) Sep-Nov (17) Dec-Feb (2) Language All languages English (192) Showing 192: English reviews Clear all nadia586 San Francisco, California 1 review “ First time rafting was amazing! ” Reviewed August 9, 2016 Our group wasn't sure what we were getting ourselves into, and we're bit nervous at first. However, by the time ergot through the first rapid we were excited! The guides are friendly,knowledgeable, and fun. Ask if mike Ross can be your guide if you're looking to laugh your way through your ride. We did the half day and are thinking... More Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank nadia586 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Hi Nadia- Thank you for your awesome trip review! We are glad you chose to raft with us and enjoyed having Mike Roth as your guide. We hope to see you again on the river soon! More tomL5401RN Grass Valley 1 review “ Awesome time ” Reviewed August 8, 2016 Had a great time. Guide was great and knowledgeable. Asked what kind of a trip we wanted and delivered. Nice location and grounds. Good equipment. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank tomL5401RN Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your trip review, and we hope to see you again soon! More M6776WKwill San Francisco 1 review “ Fun experience ” Reviewed August 8, 2016 Went with coworkers, and had a good time. Ivan was a cool guide! Be ready to get wet and make sure you have a lot of sunscreen. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank M6776WKwill Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your trip review! We agree- sunscreen is required! :) More jela408 San Jose, California 1 review “ Truly a blast! ” Reviewed August 8, 2016 We can't stop talking about it. Had so much fun! can't wait to do it again. Thank you Gabriel you truly made it memorable. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank jela408 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your trip review! We hope to see you again on the river! More Hecocks Murphys, California 1 review “ Impromptu family vacation ” Reviewed July 31, 2016 Our guide Oliver was the best. He was so funny and knowledgable of the river rapids. He allowed plenty of crazy rides. The lunch was awesome too. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank Hecocks Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for choosing to raft with us and for leaving a trip review! We are glad you had a fun time on the river! More ShootingStar3 Sacramento Level Contributor 3 reviews 3 helpful votes “ Great day on the river ” Reviewed July 31, 2016 We had a great guide, safe, fun day going through the class 3 rapids. This adventure outfitter does not require helmets - huge benefit! Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank ShootingStar3 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for rafting with us! We hope to see you again soon! More Michael W 2 reviews “ Great time! ” Reviewed July 31, 2016 I have been rafting the American River for the past 20 years and I have never had such a good experience! The staff at Beyond Limits were professional and personable. My wife and son had never been on the river and they had a great time as well. The trip was great from beginning to end, would highly recommend this... More",
            "Great family fun if kids have adventurous spirit. You will get wet! The guide, Ivan, kept us safe the entire trip. They kept it fun the whole trip. There river access was great... read more",
            "",
            "We had Christine as our guide which is very friendly and totally recommend. The owner was very professional, we had a group that wanted to pay per card separate and he was the... read more",
            "We went with a small group from work and had 2 boats. We opted for the more adventurous option and it surely delivered 😊. Our guide, Chris, was awesome, telling us about the area... read more Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Reviewed June 14, 2015 suwalters , Fremont, California Add Photo Write a Review 192 Reviews from our TripAdvisor Community Which Lotus hotels are on sale? mm/dd/yyyy mm/dd/yyyy See hotels Sponsored links * See what travelers are saying: Traveler rating Excellent (177) Very good (14) Average (1) Poor (0) Terrible (0) Traveler type Families (86) Couples (12) Solo (1) Business (6) Friends (74) Time of year Mar-May (10) Jun-Aug (163) Sep-Nov (17) Dec-Feb (2) Language All languages English (192) Showing 192: English reviews Clear all suwalters Fremont, California 1 review “ Will definitely do this again! ” Reviewed June 14, 2015 We went with a small group from work and had 2 boats. We opted for the more adventurous option and it surely delivered 😊. Our guide, Chris, was awesome, telling us about the area and history along the ride. We had a total blast!! Thanks, Chris!! Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank suwalters Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for the trip review! We are glad you enjoyed having Chris as your guide, and we hope to see you on the river again! More Deidra M Oakland, California Level Contributor 3 reviews “ Awesome experience ” Reviewed June 13, 2015 From start to finish, my experience with Beyond Limits Adventures was incredible. The guides are extremely skilled, hilarious, personable, care about your safety, and want to give you the kind of rafting experience you want. In our group of 4 rafts, one group/raft wanted their experience to be as mellow as possible, and their guide seemed to honor that, while... More",
            "this our 5th year in row with Beyond Limits and as far as I'm concerned they are the best out there. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Reviewed July 21, 2015 Steven P , Marysville Add Photo Write a Review 192 Reviews from our TripAdvisor Community Which Lotus hotels are on sale? mm/dd/yyyy mm/dd/yyyy See hotels Sponsored links * See what travelers are saying: Traveler rating Excellent (177) Very good (14) Average (1) Poor (0) Terrible (0) Traveler type Families (86) Couples (12) Solo (1) Business (6) Friends (74) Time of year Mar-May (10) Jun-Aug (163) Sep-Nov (17) Dec-Feb (2) Language All languages English (192) Showing 192: English reviews Clear all Steven P Marysville 1 review “ Always a great time!!! ” Reviewed July 21, 2015 this our 5th year in row with Beyond Limits and as far as I'm concerned they are the best out there. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank Steven P Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for the trip review, Steven! We agree! More TFedelin San Jose, California 1 review “ Great family fun! ” Reviewed July 21, 2015 We come here annually and it is so much fun! The staff is truly some of the best guides on the river. The food is great and the sites and restrooms are very clean. I look forward to this escape from the city and truly enjoy our weekend of camping on the river without having to lug out all of... More Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank TFedelin Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your awesome trip review and for staying with us! We enjoyed having your group raft and camp, and are so glad that you chose to book our all-inclusive 2-day trip. It is definitely the best way to raft and camp on the American River! We hope to see your family and group again soon! More 999erika Tracy, California 1 review “ Beyond Limits Adventures Rafting Trip ” Reviewed July 20, 2015 I have not been able to take a vacation in many years, consequently when dad told me he was planning a single day get away I knew I could pull this one off. We had a large party of 11 and they accommodated us very well. They kept us together and we had a blast. They were knowledgeable about the... More Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank 999erika Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for the trip review! We are glad that you were able to raft with us and have some family fun on the river! More will990 San Jose, California 1 review “ Beyond expectations ” Reviewed July 19, 2015 Meet up with friends this past Saturday for whitewater rafting. We opted for level 3. The site is clean, the staff are very welcoming and friendly. Our guide Gene, was awesome and knowledgeable with the scenic route. He gave us a little history of the area, the surrounding farmlands, older gold mines, and some geo/rock guide. While paddling around the... More Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank will990 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your trip review! We are glad to hear that you enjoyed rafting with us, and we hope to see you again on the river! More Larry S Tracy, California Level Contributor 98 reviews 43 attraction reviews 31 helpful votes “ Way Beyond Wet! ” Reviewed July 19, 2015 One of our worries this trip was the fear of not enough water for rafting, but those fears were soon dissipated when we saw the upper stretch of the South Fork of American River. Plenty of water. There was eleven of us in our family adventure ranging in age from 15 to 71 (me) and everywhere in between. We were... More Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? 1 Thank Larry S Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Wow! Thank you for the excellent trip review, Larry! We are so happy to hear that you enjoyed every aspect of your rafting trip. Thank you for choosing to raft with us, and we can't wait to see you again next time! More BfunkP Level Contributor 2 reviews 1 helpful vote “ Incredible 2 day family fun ” Reviewed July 18, 2015 We want to thank Beyond Limits Adventure for a memorable family trip. Special thanks to our rafting guide extraordinary Chris. My husband has been on many rafting runs, and this one by far was the best - what made it great was a guide that really knows how to read the river. We had a blast. Thanks to Chris for... More",
            "Our Guide Don was so much fun. He show un how much fun you can have working together as a team. How to listen and size up the different situations that are presented to all of... read more Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Reviewed August 19, 2015 fbphil , Worcester, Massachusetts Add Photo Write a Review 192 Reviews from our TripAdvisor Community Which Lotus hotels are on sale? mm/dd/yyyy mm/dd/yyyy See hotels Sponsored links * See what travelers are saying: Traveler rating Excellent (177) Very good (14) Average (1) Poor (0) Terrible (0) Traveler type Families (86) Couples (12) Solo (1) Business (6) Friends (74) Time of year Mar-May (10) Jun-Aug (163) Sep-Nov (17) Dec-Feb (2) Language All languages English (192) Showing 192: English reviews Clear all fbphil Worcester, Massachusetts 1 review “ Great Family Adventure ” Reviewed August 19, 2015 Our Guide Don was so much fun. He show un how much fun you can have working together as a team. How to listen and size up the different situations that are presented to all of us. He is a great stand up, and singer. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank fbphil Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your trip review! We are glad you enjoyed having Don as your guide and raft entertainment! More chrystalcurran Concord, California 1 review “ South fork river rafting ” Reviewed August 14, 2015 Me and my boyfriend had never went river rafting before and it was a great first experience. Nice and friendly people and fun trip! Definitely recommend it. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank chrystalcurran Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for your trip review! We are happy to hear that you enjoyed your trip. We hope to see you again on the river soon! More Jessie V 1 review “ Thrilling Experience on the American River ” Reviewed August 14, 2015 The full day whitewater rafting experience, led by Chris, was barrels of fun! Scott snapped some great photos along the way! Beyond Limits exceeded our expectations, indeed! Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank Jessie V Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thank you for rafting with us, Jessie! We are glad you enjoyed having Chris as your guide. We hope you and your family will visit us again! More davidblum415 San Francisco, California 2 reviews “ Gene was great! ” Reviewed August 13, 2015 We went this past Sunday, had a blast! Our guide, Gene, was great. Looking forward to trying the level 4 next time around. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank davidblum415 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Thanks for your trip review, David! We would love to have your group raft on the class IV Middle Fork section! More vict0ria987 Saint Louis, Missouri 1 review “ Chili Bar run 1/2 day ” Reviewed August 13, 2015 Family enjoyed trip. It was our first time white water rafting. First part of trip had good class III rapids but then slowed down considerably. Kids would have liked more class III rapids throughout. It is suppose to be more intense in spring with snow melting from mountains. Water was colder than expected being from mid-west. Chili dogs, fruit and... More Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank vict0ria987 Report MikeD209, Owner at Beyond Limits Adventures - Day Trips, responded to this review Hi Victoria! Thank you for your trip review. If you are looking for a longer trip, we would love to have your group raft down the Lower section of the SFA. There are some awesome rapids on this 10 mile section of the river that your family would enjoy. Thanks again! More msmcelligott san jose Level Contributor 33 reviews 7 attraction reviews 39 helpful votes “ Whitewater rafting and 2 days camping with 2 adults and 3 teens ” Reviewed August 10, 2015 We stayed 2 nights on their property in a tent cabin and enjoyed a rafting adventure. Overnight stays: Their campground is relatively small (maybe 4 tent cabins, a yurt and some tent camping space), however they have some great amenities. First, they have a beer / wine bar, a small grocery and lots of space to hang out and relax/party.... More",
            ""
        ],
        "longitude": "-120.902868663539",
        "no_of_reviews": "192",
        "address": "7321 River Park Drive , Lotus , CA 95651",
        "rank": "1",
        "youTubeIds": "xRJoQ5vhsCo,dvf-yt7dMfE,oq4Lr-mK3GI"
    },
    "Adventure Connection": {
        "knownFor": "River Rafting & Tubing , Other Outdoor Activities , Wine Tours & Tastings , Boat Tours & Water Sports , Tours , Food & Drink , Outdoor Activities , More",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32663-d6197402-Reviews-Adventure_Connection-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d6197402-Reviews-or80-Adventure_Connection-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d6197402-Reviews-or50-Adventure_Connection-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d6197402-Reviews-or70-Adventure_Connection-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d6197402-Reviews-or60-Adventure_Connection-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d6197402-Reviews-or40-Adventure_Connection-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d6197402-Reviews-or30-Adventure_Connection-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d6197402-Reviews-or20-Adventure_Connection-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d6197402-Reviews-or10-Adventure_Connection-Lotus_California.html"
        ],
        "contact": "+1 530-626-7385",
        "reviewComments": [
            "Great and friendly staff. We made the \"easy\" trip, which, indeed was easy, but still fun and we get wet :) You can go there even if you are afraid or if you can't oar. The staff... read more",
            "The river was a little low for this time of year August 2008. It was milder than what we expected. It was a great day as it always is in the river with a good boatman. The... read more",
            "We crept into camp sometime after midnight, which was a bit later than we had anticipated, but I was not able to get that Friday off. Fortunately, we ran into Tammi & Tawny, who... read more",
            "It was a FANTASTIC day thanks to family members and our guide Dave. Lunch was very good too. Note: We had a half price off coupon for this and it was WELL worth the cost. This... read more",
            "We just spent a day with Adventure Connection rafting the American River. We LOVED it! They really do a great job. We have two teenagers and Ryan our guide made our trip so much... read more",
            "I'm a single mom with four kids (16,14, and 10 yr old twins) so finding things to do (other than amusement parks) can be tricky because my kids ages are varied. Making the choice... read more",
            "We had a wonderful full-day trip on the South Fork of the American River. The views were beautiful and we even saw the bald eagle that has taken up residence along the route... read more",
            "2nd time with this company. We had a great time both times. As rafting companies go, they are pretty well organized. Started on time. Boats were ready to go at the river... read more",
            "Took a half day with my leadership team this week. Fabulous day of team building, fresh air, and fun. Tigre was a perfect fit for our team. Aggressive hole surfing... read more"
        ],
        "longitude": "",
        "no_of_reviews": "83",
        "address": "6500 State Highway 49 , Lotus , CA 95651-9755",
        "rank": "3",
        "youTubeIds": "eKr519V8OWI,Y97NqNblEuM,JhaMssXl01k"
    },
    "O.A.R.S. American River Day Rafting": {
        "knownFor": "River Rafting & Tubing , Boat Tours & Water Sports , Tours , Outdoor Activities",
        "latitude": "38.8074962149203",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1967130-Reviews-O_A_R_S_American_River_Day_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1967130-Reviews-or20-O_A_R_S_American_River_Day_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1967130-Reviews-or90-O_A_R_S_American_River_Day_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1967130-Reviews-or50-O_A_R_S_American_River_Day_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1967130-Reviews-or40-O_A_R_S_American_River_Day_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1967130-Reviews-or30-O_A_R_S_American_River_Day_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1967130-Reviews-or10-O_A_R_S_American_River_Day_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1967130-Reviews-or70-O_A_R_S_American_River_Day_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1967130-Reviews-or60-O_A_R_S_American_River_Day_Rafting-Lotus_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32663-d1967130-Reviews-or80-O_A_R_S_American_River_Day_Rafting-Lotus_California.html"
        ],
        "contact": "+1 530-626-5600",
        "reviewComments": [
            "We booked the last weekend of the season and it was AWESOME! I was worried about it being cold, but OARS provided us with splash jackets and optional wetsuits, and we were... read more",
            "This was our first rafting trip and was by far the best! Our guide was excellent and created such a fun atmosphere for us and our kids. We were all a bit nervous, but our guide... read more",
            "I brought my bachelorette party for a weekend with OARS on the South Fork of the American River. I wish every weekend could be this incredible. OARS is hands down the best... read more",
            "My advice to you that you are reading this comment before to decide to go on a OARS trip is to realize that life is short, we all work very hard to pay our bills and with what is... read more",
            "OARS is a great organization that provides a top notch rafting experience! This was our 2nd trip with a group of fathers and sons and we were not disappointed. The guides are... read more",
            "Discovering white rafting as a family this experience could not have been more perfect! All the rafting guides were super friendly and made if fun both for the kids and the... read more",
            "On July 24th, my family of 4 booked the 1 day excursion. We were paired with Tanner as our guide, and it could not have been a better fit for our boat. He was interactive... read more",
            "We went on a Monday trip (make sure to ask how the water is on the day you go so it's at a good level for rafting) to the South Fork American River. We had 2 great guides, Shane... read more",
            "My 12 yr old son and I did a two day raft on south fork American river. Rented the platform tent. Was wonderful to show up and have the it all set up, the beds were comfortable... read more",
            "Excellent white water rafting trip. OARS guides made it memorable and fun. Highly recommend it. Sabrina and Ben are great guides. The water was sufficient to have a few adrenaline... read more"
        ],
        "longitude": "-120.903080973588",
        "no_of_reviews": "96",
        "address": "7330 River Park Dr. , Lotus , CA 95651",
        "rank": "2",
        "youTubeIds": "_VXdR3LFewk,JUbvLSLT7r0,uj8PfeYKvas"
    }
}