{
    "Guajome County Park": {
        "knownFor": "Nature & Parks",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1060185-Reviews-Guajome_County_Park-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1060185-Reviews-or60-Guajome_County_Park-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1060185-Reviews-or50-Guajome_County_Park-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1060185-Reviews-or40-Guajome_County_Park-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1060185-Reviews-or30-Guajome_County_Park-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1060185-Reviews-or20-Guajome_County_Park-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1060185-Reviews-or10-Guajome_County_Park-Oceanside_California.html"
        ],
        "contact": "+1 858-694-3049",
        "reviewComments": [
            "Guajome has miles of trails that wind through the valley. The park and trails are well maintained to allow for walking, running, biking, or horseback riding. There is always... read more",
            "Guajome Lake, while not an awe inspiring wonder of the world, is a very nice overgrown park in the middle of urban sprawl. It's big enough that you forget you are surrounded by... read more",
            "What a great place to bring the kids! Walking trails that aren't crowed can bring loads of imagination to little minds. One can almost pretend they are on a deserted island and... read more",
            "It's a good place for a short camping trip. Decent camp sites, good bike trails, generally safe area and have fun fire place areas. Very cheap and affordable, especially if you... read more",
            "This place is a great spot for a day time picnic or a pick up game of futbol. Family friendly park....but be wise to stay away at night.",
            "This is a nice place not too far from the beach. Lots and lots of mosquitoes! Nice trails for walking or riding bikes. We took a look inside the cabin. Very nice. Too bad... read more",
            "The camping spaces are good sized and well maintained with water and electric hook ups. The trailer didn't need to be leveled which was nice. There were other people camped... read more"
        ],
        "longitude": "",
        "no_of_reviews": "62",
        "address": "3000 Guajome Lake Rd , Oceanside , CA 92057-5644",
        "rank": "9",
        "youTubeIds": "d-P9CpRFORE,FU-0B1ZDsjI,8lBIzTAA5S8"
    },
    "Oceanside Farmer's Market": {
        "knownFor": "Flea & Street Markets , Shopping",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1407951-Reviews-Oceanside_Farmer_s_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1407951-Reviews-or80-Oceanside_Farmer_s_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1407951-Reviews-or50-Oceanside_Farmer_s_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1407951-Reviews-or40-Oceanside_Farmer_s_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1407951-Reviews-or30-Oceanside_Farmer_s_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1407951-Reviews-or20-Oceanside_Farmer_s_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1407951-Reviews-or10-Oceanside_Farmer_s_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1407951-Reviews-or60-Oceanside_Farmer_s_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1407951-Reviews-or70-Oceanside_Farmer_s_Market-Oceanside_California.html"
        ],
        "contact": "+1 760-754-4512",
        "reviewComments": [
            "Love this market. Amazing fresh food to use in preparing so many different dishes for aspiring chefs.. Will not disappoint..",
            "Excellent choice of fruit and vegetables at very good prices. I loved the choices of breads, cheeses, fish and more and there were also food vendors offering reasonably priced... read more",
            "Good place to pick up local produce. Also some interesting art for sale and unique items. We really liked the hand made soaps and bath products. Also a lot of food vendors... read more",
            "They have since expanded to another block which added a lot more vendors. I love the mushroom lady stand always have fresh organic mushrooms you never ever heard of. They have a... read more",
            "Hot food from around the world such as barbecue, lumpia, and Venezuela to snacks to go such as fudge and chocolate almond croissant( OMG delicious). Live music and friendly... read more",
            "We had no idea this was happening and stumbled upon it on our way out of town. Highly recommend this for GREAT food (huge variety) and local flare!",
            "We went to both the Farmers Market during the day and the Evening. Lots of different Vendors, something for everyone.",
            "In the morning, it is to sell locally grown veggies and fruits and in the evening it is more food carnival. Check it out if you are there midweek. They block off the street. It... read more",
            "This market has everything from local produce to fresh fish to crafts. It is on Thursday and is definitely worth visiting. The unique variety of foods can meet everyone's pallet... read more"
        ],
        "longitude": "",
        "no_of_reviews": "93",
        "address": "corner Coast Highway & Pier View Way , Oceanside , CA",
        "rank": "8",
        "youTubeIds": "18oQgDkt-TI,CqBdCjlKpjU,-6Bq3_ay6_w"
    },
    "Harbor Beach": {
        "knownFor": "Beaches , Outdoor Activities , Nature & Parks",
        "latitude": "33.2117677",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32815-d4098333-Reviews-Harbor_Beach-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d4098333-Reviews-or20-Harbor_Beach-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d4098333-Reviews-or110-Harbor_Beach-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d4098333-Reviews-or90-Harbor_Beach-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d4098333-Reviews-or80-Harbor_Beach-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d4098333-Reviews-or100-Harbor_Beach-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d4098333-Reviews-or70-Harbor_Beach-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d4098333-Reviews-or60-Harbor_Beach-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d4098333-Reviews-or50-Harbor_Beach-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d4098333-Reviews-or40-Harbor_Beach-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d4098333-Reviews-or30-Harbor_Beach-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d4098333-Reviews-or10-Harbor_Beach-Oceanside_California.html"
        ],
        "contact": "",
        "reviewComments": [
            "The harbor is very large at first site but a beautiful site. There are shops and dining all over and you can pretty much walk. There's a pretty decent nightlife and unless you... read more",
            "We didn't go to the actual beach but rather walked down the pier with shops and restaurants to find a place for dinner. The views were great and it was neat to check out all the... read more",
            "Lovely sand beach, waves are a little gentler here due to the retaining walls of the harbour making it great for kids to enjoy the water. Sand is gorgeous and clean. Life guards... read more",
            "Nice beach, great place to watch the surfers and enjoy the sand and surf. Full facilities - life guards, showers, bathroom. This beach seemed less crowded than the pier beach... read more",
            "Lots of parking to go enjoy this great beach. Plenty of room to walk and enjoy everything in the area.",
            "Surfers, nature enthusiasts or couples looking for a FREE place for a candle light picnic will love the jewel. Trust me.",
            "Many restaurants there, sunset was wonderful! It is a great spot if you want to stroll around, buy some gifts and have a nice dinner with a special sunset view... Talking about a... read more",
            "Harbor beach is our family's favorite California beach. It's tucked away just south of Camp Pendleton. It gets packed on weekends but is wide open during week day afteenoons. The... read more",
            "Very clean, not overcrowded, love the walk on the breakwall. The shops and restaurants are fun and affordable.",
            "The area had boat area, beach, and many cute shops and resteraunts. Very clean and nice area, friendly people.",
            "This beach is a pay for use location, metered or pay station 15 min for 25 cents or I think $2.00 hour. Day pass is best rate but still pricey for going to the beach. That being... read more",
            "This is a very clean, well kept beach. Beautiful blue water with some great waves. There were a lot of surfers out. It was fun to watch them catch some waves. You have an awesome... read more"
        ],
        "longitude": "-117.3864898",
        "no_of_reviews": "124",
        "address": "Harbor Drive , Oceanside , CA",
        "rank": "5",
        "youTubeIds": "fz6ue63AFms,ZBpMYY7Vl1I,FzRgbMmq9SM"
    },
    "California Surf Museum": {
        "knownFor": "Specialty Museums , Museums",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-California_Surf_Museum-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-or20-California_Surf_Museum-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-or120-California_Surf_Museum-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-or50-California_Surf_Museum-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-or110-California_Surf_Museum-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-or100-California_Surf_Museum-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-or90-California_Surf_Museum-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-or60-California_Surf_Museum-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-or80-California_Surf_Museum-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-or70-California_Surf_Museum-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-or40-California_Surf_Museum-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-or30-California_Surf_Museum-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1897627-Reviews-or10-California_Surf_Museum-Oceanside_California.html"
        ],
        "contact": "+1 760-721-6876",
        "reviewComments": [
            "You are struck by the openness of this museum right when you walk in. Expect to see and learn surf. Great displays, graphics but easy to understand eplanations and stories",
            "We enjoyed this small museum. It had been featured on a local TV program a few weeks before our weekend in Oceanside, or we would not have known of it. Lots of surfboards and... read more",
            "The California Surf Museum is great. They are in new digs and they have done a great job with their displays. Definitely recommend.",
            "I've never surfed in my life, but my teenage daughter loves it. So we decided to stop in Oceanside to check out this museum on a leisurely drive from LA to San Diego. It was well... read more",
            "If you visit on Tuesday, it's a fabulous deal as it is free. You can go through the museum very quickly, since it is small. They have some interesting displays, and it is worth... read more",
            "Anyone interested in the history of surfing or wave sports must stop by here. The new location and building are amazing! The eclectic mix of items on display from boards to photos... read more",
            "Wonderful museum....always has good artists on display. We were lucky to have a docent discuss some of the artists work on display. Also, they have live jazz and more reaching... read more",
            "Small museum is bigger than you might think, well organized, a bargain admission. Very interesting and entertaining for surfers and non-surfers alike. Even worth more than one... read more",
            "If your in the area of the pier or in Oceanside, hit the Surf museum. The staff is awesome and incredibly knowledgable about the surf seen and the history of surf in the area... read more",
            "I really enjoyed visiting the surf Museum, so much fun and learned a lot, it is not very big, the people who work there are so nice, they are very helpful and will answer... read more",
            "Finally made it to Surf Museum and it was well worth the wait! I imagine there are MANY locals that have never visited museum and I suggest you place it on your bucket list. You... read more",
            "I don't surf, never have, but the guidebook suggested this was a \"must see\" attraction in Oceanside. We were there for some late sun in November and Oceanside is pretty quiet, so... read more",
            "We got in when they first opened in the morning and Cramer gave a awesome tour and all the history of the areas and surfing . This place has some incredible exhibits and the... read more"
        ],
        "longitude": "",
        "no_of_reviews": "132",
        "address": "312 Pier View Way , Oceanside , CA 92054-2525",
        "rank": "7",
        "youTubeIds": "3e5m_Cz-IIk,PkCgrZa0bIY,W0MnNjhQq-c"
    },
    "California Welcome Center": {
        "knownFor": "Visitor Centers , Traveler Resources",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32815-d7710468-Reviews-California_Welcome_Center-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d7710468-Reviews-or80-California_Welcome_Center-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d7710468-Reviews-or50-California_Welcome_Center-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d7710468-Reviews-or40-California_Welcome_Center-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d7710468-Reviews-or20-California_Welcome_Center-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d7710468-Reviews-or10-California_Welcome_Center-Oceanside_California.html"
        ],
        "contact": "+1 760-721-1101",
        "reviewComments": [
            "This is a great place to start your trip to Oceanside. The staff was very welcoming and accommodating. They have lots of information to share and advice to give about the area. We... read more",
            "The staff were super friendly and helpful in getting me directions and area information. They even had a cool little gift shop with Oceanside souvenirs too.",
            "",
            "The Volunteers at the wellcome center where amazing, very friendly and provide us with all the information we need it.",
            "Everyone there were extremely helpful! Lots of great literature! Pleasant environment. Lots of ideas for things to do in SoCali. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Reviewed June 1, 2016 adoptfromashelter , Santa Ana, California Similar Things to Do in Oceanside See all Traveler Resources in Oceanside Oceanside Public Library 14 Reviews <![if !IE 8]> <![endif]> 0.4 miles QLN Conference Center 2 Reviews <![if !IE 8]> <![endif]> 5.5 miles Add Photo Write a Review 89 Reviews from our TripAdvisor Community Which Oceanside hotels are on sale? mm/dd/yyyy mm/dd/yyyy See hotels Sponsored links * Read reviews that mention: All reviews local attractions discount tickets visitor center info literature california visitors gifts leaflet volunteers freeway knowledge legoland Review tags are currently only available for English language reviews. Read reviews in English Go back Traveler rating Excellent (74) Very good (9) Average (3) Poor (1) Terrible (0) Traveler type Families (29) Couples (31) Solo (9) Business (5) Friends (8) Time of year Mar-May (19) Jun-Aug (42) Sep-Nov (13) Dec-Feb (13) Language All languages English (87) German (1) Spanish (1) Showing 87: English reviews Clear all adoptfromashelter Santa Ana, California 1 review 1 helpful vote “ California Welcome Center San Clemente ” Reviewed June 1, 2016 Everyone there were extremely helpful! Lots of great literature! Pleasant environment. Lots of ideas for things to do in SoCali. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? 1 Thank adoptfromashelter Report HeyLyd, Front Office Manager at California Welcome Center, responded to this review Hello Adoptfromashelter, Thank you for stopping by to visit the center. We appreciate your kind review, it's very important to us! Please stop in each time you are in Oceanside! We are open everyday from 9-5pm. Thank you again! California Welcome Center, Oceanside More Bob M Rockwall Level Contributor 2 reviews “ California Adventure ” Reviewed May 31, 2016 Oceanside Visitors Center was helpful. They told how to get to the San Luis Rey Mission and other attractions. Also gave us restaurant suggestions and coupons. We were given booklets of information. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank Bob M Report HeyLyd, Front Office Manager at California Welcome Center, responded to this review Hello Bob, Thank you for stopping by to visit the center. We appreciate your kind review, it's very important to us! Please stop in each time you are in Oceanside! Thank you again! California Welcome Center, Oceanside More GregHerr Oceanside, California 2 reviews “ Very Nice Staff ” Reviewed May 31, 2016 The staff here was very nice and helpful. Any question that I had, they answered it. I recommend taking a little trip here and check out all the stuff they have. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank GregHerr Report HeyLyd, Front Office Manager at California Welcome Center, responded to this review Hello Greg! We appreciate your kind review, it's very important to us! Thank you for stopping in the see us! Please stop in each time you are in Oceanside! Thank you again! California Welcome Center, Oceanside More timesharetraveler11 Miamisburg, Ohio Level Contributor 274 reviews 68 attraction reviews 202 helpful votes “ Good Information ” Reviewed May 29, 2016 The Welcome Center is located in Oceanside very near one of the I 5 exits. It has a lot of information on things to do in the area. Helpful? Thank timesharetraveler11 Report HeyLyd, Front Office Manager at California Welcome Center, responded to this review Hello Time Share Traveler! We appreciate your kind review, it's very important to us! Thank you for stopping in the see us! Please stop in each time you are in Oceanside! Thank you again! California Welcome Center, Oceanside More A P Columbus, Ohio Level Contributor 31 reviews 13 attraction reviews 3 helpful votes “ good for face to face information ” Reviewed April 19, 2016 the information they provided could just as easily have come from trip advisor but it feels more like a personal review.I am not much for printed maps but the woman who helped us worked with us to find something for my jaded world travelling pre-teen son. He really enjoyed her recommendation and i wouldn't have gone if she hadn't pointed... More",
            "Enjoyed our visit to the info center. All were friendly and helpful and answered our questions knowledgeably. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Reviewed July 6, 2016 delene2jim , Ladera Ranch, California Similar Things to Do in Oceanside See all Traveler Resources in Oceanside Oceanside Public Library 14 Reviews <![if !IE 8]> <![endif]> 0.4 miles QLN Conference Center 2 Reviews <![if !IE 8]> <![endif]> 5.5 miles Add Photo Write a Review 89 Reviews from our TripAdvisor Community Which Oceanside hotels are on sale? mm/dd/yyyy mm/dd/yyyy See hotels Sponsored links * Read reviews that mention: All reviews local attractions discount tickets visitor center info literature california visitors gifts leaflet volunteers freeway knowledge legoland Review tags are currently only available for English language reviews. Read reviews in English Go back Traveler rating Excellent (74) Very good (9) Average (3) Poor (1) Terrible (0) Traveler type Families (29) Couples (31) Solo (9) Business (5) Friends (8) Time of year Mar-May (19) Jun-Aug (42) Sep-Nov (13) Dec-Feb (13) Language All languages English (87) German (1) Spanish (1) Showing 87: English reviews Clear all delene2jim Ladera Ranch, California 1 review 1 helpful vote “ So cal with grandchild. ” Reviewed July 6, 2016 Enjoyed our visit to the info center. All were friendly and helpful and answered our questions knowledgeably. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? 1 Thank delene2jim Report tonyprevity Pawcatuck Level Contributor 24 reviews 5 attraction reviews 12 helpful votes “ A Great Place to Stop At When in Oceanside ” Reviewed July 4, 2016 I saw the sign on Route 5 on my way from San Diego to Anaheim and decided to take a break and stop in. It was wonderful and the people working there were friendly and helpful. They has literature and brochures to cover everything you would want to about California. I would rate them as one of the best State... More Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? 1 Thank tonyprevity Report HeyLyd, Front Office Manager at California Welcome Center, responded to this review hi Tom, Thank you for stopping by to visit us. Wow! We certainly appreciate your kind review, it's very important to us! We are so happy that we had information that would truly make your California trip a great experience! Enjoy this beautiful state! Please stop by and see us again. Thank you again! Best Regards, More sheryls100 Lawrence, Kansas 1 review 1 helpful vote “ Folks were so helpful and friendly ” Reviewed July 3, 2016 Knowledgable, friendly, helpful. Answered our questions, helped us figure out the train schedule, great experience. Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? 1 Thank sheryls100 Report HeyLyd, Front Office Manager at California Welcome Center, responded to this review hi Sheryl, Thank you for stopping by to visit us. We appreciate your kind review, it's very important to us. We are so happy that we had information that would truly make your California trip a great experience! Please stop by and see us again. Thank you again! Best Regards, More Jeri M Troutdale, Oregon Level Contributor 11 reviews 6 attraction reviews 3 helpful votes “ Friendly staff with plenty of helpful information ” Reviewed July 1, 2016 I went into the visitor center to pick up current brochures for the condo of a friend. I was amazed at the amount of information for not only Oceanside but the surrounding areas. The staff was most helpful. I ended up adding a couple more events to my own trip based on the information I received. Helpful? 1 Thank Jeri M Report HeyLyd, Front Office Manager at California Welcome Center, responded to this review hi Jeri, Thank you for stopping by to visit us. We appreciate your kind review, it's very important to us. We are so happy that we had information that would make your California trip a great experience! Please stop by and see us again. Thank you again! Best Regards, More Lisa T Vista, California 1 review 1 helpful vote “ So welcoming and so friendly! ” Reviewed June 29, 2016 If you are looking for local stops to check out ask the people of this welcome center. They are so knowledgeable and so friendly. If you are new to the area and want to live like a local fast stop by and they'll give you all the tips you need! Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? 1 Thank Lisa T Report HeyLyd, Front Office Manager at California Welcome Center, responded to this review Hi Lisa, Thank you for stopping by to visit us. We appreciate your kind review, it's very important to us! We are so happy that we had information that would truly make your Oceanside/San Diego trip a successful one! Please stop by and see us again. Thank you again! Best Regards, More igor g Barrie, Canada 2 reviews 2 helpful votes “ Amazing people ” Reviewed June 29, 2016 Amazing people working at the tourists welcome centre. Extremely helpful and knowledgeable. Made our visit pleasant experience. Our trip in California was wonderful experience. It truly is THE GOLDEN STATE!!! Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank igor g Report HeyLyd, Front Office Manager at California Welcome Center, responded to this review Hello Igor, Thank you for stopping by to visit us. We appreciate your kind review, it's very important to us! We are so happy that we had information that would truly make your California trip a great experience! Please stop by and see us again. Thank you again! Best Regards, More TeresAAvondale Avondale Level Contributor 14 reviews 4 attraction reviews 12 helpful votes “ We were warmly welcomed, and given local directions to avoid a major back up on the Freeway. ” Reviewed June 23, 2016 We checked out the brochures, and picked up a couple of free maps. The bathrooms were immaculate! Pleasant and informative experience. Helpful? Thank TeresAAvondale Report HeyLyd, Front Office Manager at California Welcome Center, responded to this review Hello Teresa, Thank you for stopping by to visit us. We appreciate your kind review, it's very important to us! We are so happy that we had the brochures & maps you were looking for. Please stop by and see us again. Thank you again! Best Regards, More Greig B Falkirk, United Kingdom Level Contributor 10 reviews 8 attraction reviews 1 helpful vote “ Very helpful ” Reviewed June 22, 2016 Ladies were excellent. Gave me pointers on where to go in California. How to travel about San Diego, LA, Yosemite, San Francisco. Loads of leaflets and also got discounted tickets for Disneyland Review collected in partnership with this attraction This business uses tools provided by TripAdvisor (or one of its official Review Collection Partners) to encourage and collect guest reviews, including this one. Helpful? Thank Greig B Report HeyLyd, Front Office Manager at California Welcome Center, responded to this review HelloGreig, Thank you for stopping by to visit us. We appreciate your kind review, it's very important to us! And thank you for buying your Disneyland tickets at the Center! We are so happy that we had the brochures & maps you were looking for. Please stop by and see us again. Thank you again! Best Regards, California Welcome Center,... More chriskaia Phoenix, Arizona Level Contributor 132 reviews 53 attraction reviews 148 helpful votes “ WOW!!! such amazing information, friendly service and FREE ” Reviewed June 19, 2016 We received personalized attention and help in planning our stay in Oceanside and also how to take the train to San Diego. Such warm, friendly help! They even gave me a bag to carry all my maps and information. Helpful? Thank chriskaia Report HeyLyd, Front Office Manager at California Welcome Center, responded to this review Hello Chriskaia, Thank you for stopping by to visit the center. We appreciate your kind review, it's very important to us! Please stop in each time you are in Oceanside! Thank you again! California Welcome Center, Oceanside More Patric G Vancouver, Washington Level Contributor 38 reviews 14 attraction reviews 5 helpful votes “ Great information ” Reviewed June 10, 2016 via mobile We stopped here to find a map of the area. I got that and the lady at the counter filled me in with all the information about who, what, where, when and how to get around Oceanside and Carlsbad. It was absolutely perfect! Exactly what I needed! I feel like a local now. She was fantastic; I just wish I... More"
        ],
        "longitude": "",
        "no_of_reviews": "89",
        "address": "928 N Coast Hwy , Suite A , Oceanside , CA 92054-2136",
        "rank": "4",
        "youTubeIds": "bsTTblqNYw0,x6B03JW6VGI,SHpNOZi3JHQ"
    },
    "COASTER": {
        "knownFor": "Tramways , Transportation",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or20-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or470-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or50-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or40-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or30-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or10-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or460-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or450-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or60-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or440-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or420-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or70-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or430-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or410-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or400-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or80-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or390-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or380-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or370-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or90-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or360-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or350-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or340-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or100-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or330-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or320-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or310-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or110-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or300-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or290-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or280-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or120-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or270-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or260-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or250-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or130-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or240-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or230-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or220-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or140-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or210-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or200-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or190-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or150-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or180-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or170-COASTER-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d1474134-Reviews-or160-COASTER-Oceanside_California.html"
        ],
        "contact": "+1 760-966-6500",
        "reviewComments": [
            "I really like using the Coaster between San Diego and Oceanside. It is very economical and has good service times! I have tried other options like the Bus, however, this was... read more",
            "Very cheap, and it is on time. You can get a day pass, go most places of interest. Easy to find. Mamy stops along the way. It runs on time. And one can take it to downtown, eat... read more",
            "Avoid the traffic getting to downtown or Petco. Clean and comfortable, especially if you are a senior.",
            "Really a neat way to see the coast of SoCal! Fast and efficient way to get from Orange County and San Diego County. Only problem is that it is a bit on the high cost side to take... read more",
            "Love taking the coaster to San Diego, park the car and ride. We take it to the airport, then the bus, so easy. reasonably priced and down right cheep for seniors.",
            "Used it several times om my trip - to Old Town San Diego, up to Irvine. Love the scenery, the staff is a bit frazzled and not as friendly as in past, but it was a busy time of... read more",
            "If you can find the place to board the train in oceanside, you'll enjoy your peaceful and somewhat scenic ride to San diego. Only $11 round trip!! Some descriptions are a little... read more",
            "Easy walk to the Midway Aircraft Carrier museum and Little Italy for lunch.",
            "We liked this service because it gave us a quick way to get down to San Diego without fighting the traffic.",
            "The best way to beat the summer traffic and enjoy the beautiful scenery! Hop aboard the train and sit back and relax!",
            "Took the coaster directly along the coast to Little Italy downtown San Diego. Saw dolphins playing in the waves in the ocean. Inexpensive and fun.",
            "We took the Coaster train up to Carlsbad for the day from the Sante Fe station in San Diego. There are parking lots nearby the station, and you buy your tickets from a kiosk on... read more",
            "We decided to take the Coaster for a day trip to San Diego. The price is very reasonable, especially for Seniors. It is a pleasant trip.",
            "Nice way to unwind getting to and from San Diego to Oceanside and back again with stops in Encinitas, Solana Beach...the locals who work in S.D. use this.",
            "We took the bus from SD airport to Santa Fe train station and caught the Coster to Carlsbad. Smooth ride. Easy to use. Cheap and ON TIME. a 5 minute walk from train station in... read more",
            "This stretch of the San Diego-LA train route is the most scenic! The Coaster is actually a commuter train running during rush hours M-F. But due to the popularity of the route... read more",
            "I used the Coaster service for a couple of days between Oceanside and San Diego. A $12 day pass was very good value, allowing me to go on the street cars in San Diego as well... read more",
            "Took the Coaster to go to San Diego & found it a great way to travel without the hassle of having to drive into town & parking but this only works for weekdays, the same schedule... read more",
            "first part of vacation was in San Diego -- decided to ditch the rental car an meet friends in Carlsbad. Clean, timely and easy train ride.",
            "If you hate driving the Southern California Freeways as much as I do but want to see all the attractions, take the Coaster, the commuter train starting in Oceanside and ending at... read more",
            "We used \"The Coaster\" to get to Old Towne. This allowed to travel South & not have to worry about Driving. Loved the Sun Set on the back to Oceanside.",
            "I liked it because it was punctual. Very dependable. The locals riding the train were very helpful with all the questions we had.",
            "Cheap & Easy way to get to Del Mar Race Track. Very convenient. Was only a 2 block walk from our hotel. Would recommend.",
            "We are seniors so for $11 we were able to go to San Diego from Carlsbad. Sit back and leave the driving to the Coaster. Wish our city had something like this.",
            "We were visiting Oceanside, and the California Welcome Center coached us through paying a total of $11.00 for two senior return tickets on the Coaster to San Diego. It takes one... read more",
            "This is a perfect way for visitors to Carlsbad to easily spend a day in San Diego. The train stops in several locations along the coast and families can just buy (very... read more",
            "This is a wonderful way to travel down the coast. The cost is less than driving (when you consider parking costs), the cars are clean, and you can concentrate on the scenery... read more",
            "When track is next to beach it's great but lots of the journey is a bit dull . From carlsbad to solana beach is enough unless you want to go to san diego",
            "Nice to see public transportation being used and well thought out. Don't sit in traffic. If you are going to Midway, Old Town, or Padre's game this is the way to go. Spectacular... read more",
            "we have taken the Coaster to Sea Side Village and from Carlsbad to the Amtrack station to get to an Angles game. Fun and fast.",
            "We ride the coaster occasionally to San Diego's Little Italy farmers market (which by the way is also wonderful) and love the convenience, the price, the schedules, and the view... read more",
            "Loved the convenience and it takes you all along the coast. Great for the environment. Less cars polluting. Great prices for seniors. Makes about six stops along the Coast.",
            "a quick train ride and you are in old town. great day trip and you can avoid the traffic hassle into and out of the city.",
            "I love riding the coaster to San Diego _ from it I can walk to Seaport Village - the Midway - take a harbor cruise - walk to downtown shopping - go to Little Italy - go to old... read more",
            "We had only a half day to see San Diego on this trip, so we took the Coaster from Oceanside to Old Town San Diego. The scenic trip was a little less than an hour each direction... read more",
            "Originally planned to drive to San Diego. The Coaster regional train was close to walk, cost less than $15 round trip to Old a Town or downtown SD. Public transport was easy... read more",
            "was my favorite getaway ride from carlsbad to san diego very clean and convienient and also reasonable",
            "We came for two weeks in Oceanside without a car. The coaster allowed us to visit San diego, Encinitas and Carlsbad cheaply and easily with no stress. A great way to get around.",
            "If you're staying on the coast of San Diego or close when you want to go downtown or Mission Valley East County it's a great way to go and connects to the trolly.",
            "Quick and easy once you figure out where to board. Santa Fe station alone worth a visit. Ride the top deck for the view.",
            "nice way to explore the coast go to old town connects to truly to get to Qualcomm petco Delmar downtown San Diego nice views no traffic give it a try",
            "Wanted to ride from Oceanside to San Diego just to see how it worked. Enjoyed that so much I used it for my plane trip later in the month. Worked great with the exception that the... read more",
            "Does it get any better? No traffic, met some very cool people (a surfer photog, for one, who shared dozens of unreal pix). That will be my preferred method of travel to get down... read more",
            "I took the Coaster from Oceanside to San Diego with about 15 friends to go watch a Padres game. The round trip price was very reasonable. We found out that with a Coaster ticket... read more",
            "Very convenient to get to Oceanside from Orange County.. Quick, clean and prompt arrival.. Younger even bring your bicycles on the train if you choose too.",
            "We live in San Diego but never taken the train before. On the weekend of Comic con, my husband and I were in Old Town but everything was packed so we parked our car and purchased... read more",
            "Adults are only $8 round trip and seniors are an unbelievable $4 round trip. It's a great way to leave the driving and watch the countryside go by!",
            "Cheap $5.50 one way from San Diego to Oceanside. I flew into the San Diego airport and took MTS bus 992 (fare $2.25 - have exact amount) to the Santa Fe Depot. Coaster tickets can... read more"
        ],
        "longitude": "",
        "no_of_reviews": "490",
        "address": "195 S Tremont St , Oceanside Transit Center , Oceanside , CA 92054-3028",
        "rank": "1",
        "youTubeIds": "IYZUDICkBmI,QDqlXGg394k,rBPIEzCgjaQ"
    },
    "Buena Vista Audubon Society & Nature Center": {
        "knownFor": "",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32815-d2534348-Reviews-Buena_Vista_Audubon_Society_Nature_Center-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d2534348-Reviews-or20-Buena_Vista_Audubon_Society_Nature_Center-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d2534348-Reviews-or10-Buena_Vista_Audubon_Society_Nature_Center-Oceanside_California.html"
        ],
        "contact": "+1 760-439-2473",
        "reviewComments": [
            "Love this peaceful Place on Coast Highway ! Great museum and you can arrange docents for tours ! People fish , hike & Bird Watch in this Living/Breathing Eco - System !",
            "In the middle of the hustle and bustle, you can still find a refuge to in the seclusion and sounds of the park like setting. Plan to spend a couple of hours refreshing your... read more",
            "Members and volunteers Buena Vista Audubon Society chapter operate the center located at the lagoon alongside Coast Highway 101 in Oceanside, California. The site is one of the... read more"
        ],
        "longitude": "",
        "no_of_reviews": "31",
        "address": "2202 S Coast Hwy , Oceanside , CA 92054-6549",
        "rank": "16",
        "youTubeIds": "K7IVSoZoWMM,0u2OojNeOUY,C4KGhhp_kNM"
    },
    "Oceanside Pier": {
        "knownFor": "Piers & Boardwalks , Historic Walking Areas , Sights & Landmarks",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or20-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1180-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or50-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or40-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or30-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or10-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or60-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1160-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1150-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1170-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or70-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1140-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1130-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1120-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or80-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1100-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1110-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1090-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or90-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1080-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1070-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1060-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or100-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1040-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1050-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1030-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or110-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1020-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1010-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or1000-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or120-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or990-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or980-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or970-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or130-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or960-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or950-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or940-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or140-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or920-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or910-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or930-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or150-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or900-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or890-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or880-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or160-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or870-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or860-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or850-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or170-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or840-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or830-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or820-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or180-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or810-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or800-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or790-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or190-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or780-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or770-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or760-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or200-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or750-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or740-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or730-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or210-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or720-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or710-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or700-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or220-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or690-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or680-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or670-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or230-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or660-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or650-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or640-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or240-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or630-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or610-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or620-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or250-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or600-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or590-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or580-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or260-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or570-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or560-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or550-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or270-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or540-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or530-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or520-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or280-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or510-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or500-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or490-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or290-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or480-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or460-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or470-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or300-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or450-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or440-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or430-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or310-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or420-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or410-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or400-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or320-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or390-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or380-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or370-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or330-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or360-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or350-Oceanside_Pier-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d526165-Reviews-or340-Oceanside_Pier-Oceanside_California.html"
        ],
        "contact": "+1 760-467-4565",
        "reviewComments": [
            "The pier screams everything you would expect -- the sounds and smells of the ocean, surfers, fisherman, wooden planks to walk across.",
            "Walking the pier is a great way to experience the ocean. Its great to be able to walk out past the breaking waves. there is also a very entertaining pelican near the bait shop... read more",
            "I've been to the Pier many times. Stayed at the Wyndham right across the street which is lovely, as well, and also stayed at a Days Inn by the Harbor. Anyway, back to the Pier... read more",
            "Loved how the pier is made out of all wood and is in great condition there's some etchings into the side of names of people going to find out why , at nighttime to pier was lit up... read more",
            "we took a stroll to the end of the pier had a great view of the beach at Oceanside the parking and the entrance to the pier were free a great bonus.",
            "And many people fishing. Another large California Pier. Some construction to keep it open. Yeah! Such a great way to experience the ocean. Great people watching place.",
            "Great views and people watching here. We really enjoyed watching the surfers. You can rent poles here if you want to try your hand at fishing. cute diner with views at the end.",
            "Huge surf competition but fun for families. Listen to the lifeguards people, when they say \"no swimming here due to riptide warning\" DONT!",
            "We like taking the kids here. Great to just kick back and relax or go bike riding! This place offers a great bike trail. We enjoy bike riding here.",
            "... IMHO, that is. Free parking and a short walk from the lot (or parking meters on the street), you can see people fishing from the pier, lovers strolling hand in hand... The... read more",
            "The Oceanside pier is a great spot to enjoy spectacular Southern California sunsets. It is a favorite gathering spot in the evenings. The pier itself is perfect for a nice... read more",
            "We sat on the pier to watch some young surfers. Eating at Ruby's is a great idea if you are going to the pier. Also underneath you rent bikes and other kind of transportation to... read more",
            "great place to go watch the surfers and just enjoy the ocean.",
            "Best time to walk the Oceanside Pier is early in the morning, before the crowds and fishermen arrive, as the sun is coming up and the surfers are hitting the waves. Once the... read more",
            "We took a stroll Sunday April 22 and watched a pod of five California Gray whales on thier migration north! It looked like three adults and two calfs. Get this - they swam along... read more",
            "Loved this place. Old style pier, complete with beach shop and resident pelicans! Clean and tidy, friendly locals and great sandy beach.",
            "One of the West Coast longest piers. So fun to see the cross-section of fishermen, tourists and strollers. Take a pic of the huge pelican!",
            "In general, we enjoyed the city of Oceanside. The pier was beautiful and picturesque. It was enjoyable watching people fishing off of the pier. Made for some great pictures... read more",
            "Great view, and Ruby's at the end of the pier is a family favorite stop on our tri[s to Oceanside.",
            "We have always loved Oceanside pier and the harbor! And recommend everyone to stay at \"The Oasis\", it is a vacation home rental here on TripAdvisor . In Oceanside California 92058",
            "The Oceanside Pier is a great place to people watch and get a view of the coastline. It is also a good place to take pictures of people fishing from the pier, surfers, and... read more",
            "The town of Oceanside around the pier is an exciting place to be--lots of good restaurants close by, not to mention shops and street market on the weekends. It is easily... read more",
            "This pier is especially popular with homeless-looking people who are trying to catch fish for dinner. There's a Ruby's Diner at the end of the pier which we wanted to try, but it... read more",
            "There is much going on in Oceanside but just as the name says, most of it is happening at the beach! The pier is a gathering place for people and things happening. With a longer... read more",
            "Best pier anywhere. Watch the surfers, excellent restaurant. We used the pier for our morning and evening walk. Wonderful sunset walk.",
            "A great place to take a stroll and people watch. Ruby's is on the end and its a great place to sway while tucking into a Sundae or a milkshake.",
            "The center of the town is not good to walk around.There's some people asking money .Maybe it's not always the same. Just don't walk alone. Anyway , this is California there's... read more",
            "Monday morning, peaceful walk on the pier...watching people while they are fishing...watching surfers catch a wave. Nice way to end our long weekend!",
            "This pier is not for those wanting a thrill-park experience. It is an old-timey pier but it is huge, being about a half-mile long. The views of the coast, up and down, are... read more",
            "A very nice walk down the Pier. Surfers on either side. All kinds of different birds, people fishing, and a 50's restaurant at the very end to eat at",
            "Good times great sunset and fun watching the guys fishing and surfing. walking under the pier and along the strand proved to be real fun too",
            "We stayed in Los Angeles on our trip and mostly explored that city. We took a day trip on Amtrak down to San Juan Capistrano and Oceanside. The train trip is beautiful, and... read more",
            "We love to go to the pier when we are in the area. We like to walk it, ride our bikes on it, etc... It is a great place to see pelicans and other birds and is a fantastic place... read more",
            "Take a stroll out on the Pier and see what's new today. We were able to watch seagulls, pelicans, and lots of people fishing. Its the perfect place to stop and get a good look... read more",
            "The Oceanside Pier is longer than many of the Southern California piers and a nice place to stroll. It's a bit touristy however and the Ruby's Diner at the end makes the... read more",
            "There isn't much to the pier itself (a restaurant and a shop) but the views are staggering and the walk enjoyable. A family atmosphere",
            "As we walked each night we enjoyed the views, watching people fish, sunsets, beautiful boats and several interesting large birds.",
            "Lots of room for fisherman to Spread out. We have always had good luck fishing here. Great of a leisurely walk or jog. The night fishing seems to be the best here.",
            "It is a beautiful stroll and you can rent fishing poles for only $5 per hour. The are tons of locals on the Pier fishing and it is a good place to people watch too. Then there... read more",
            "The pier is free! As you stroll out you'll pass surfers on either side. Further out are families fishing with all kinds of rigs. At the far end is and \"ice-cream\" diner. Often... read more",
            "I really love walking down the pier, there's a Ruby's diner at the end of the pier. Great place to grab a real milk shake.",
            "A walk out on the pier at sunset can't be beat! You can hang out on the pier & watch the sun sink into the ocean. If you stay awhile, the pier lights up at night and is truly... read more",
            "The longest pier in Southern California, the Oceanside Pier is a great place to walk, see views north and south along the coast, people-watch and enjoy the negative ions of the... read more",
            "Great place to go watch the waves. Awesome to go at night to see hightide. Love that it is free! Has clean bathrooms as well.",
            "If you come to Oceanside or are passing through, make time to stop and walk the pier. It is a gorgeous walk to the end. Don't wear heels!! Be prepared - walking the pier is a tiny... read more",
            "We arrived too late to enjoy the view of the Ocean but we did go out to Ruby's Diner for dinner. As always the meal was great. Whenever I'm in Oceanside we make this one of our... read more",
            "Long pier is suitable to stroll on with kids, family, and friends while enjoying the passing of frequent Amtrak trains, the armature fish men, the open water front amphitheater... read more",
            "We stopped by this quaint, small pier during our stay in Oceanside. It was nice and we enjoyed the shops and restaurants along the pier strip. We ate lunch at one of them and... read more",
            "We enjoyed the pier this afternoon - started about 3:30 walked and took in the sights... Cocktails and appetizers at the dinner and then a beautiful sunset. Dinner not much but... read more",
            "From the pier, I had close up encounters with a pelican and two herons, looking down I saw a seal swim by and gorgeous schools of sardines!",
            "Clean and fun place for walkers. Liked Ruby's food at the pier's end. Lots of families. Strolling musicians.",
            "Good exercise walk. No transportation to the end where Ruby's restaurant is located. No bicycles or skateboards allowed.",
            "Fun to walk on and people watch, it was really busy Sunday afternoon, but much less busy during the week.",
            "Oceanside Pier was first built in 1888 at what is now Wisconsin Avenue. The original pier was destroyed by storms in the winter of 1890, and was rebuilt in 1893 by Melchoir Pieper... read more",
            "Wow! It \"ap-piers\" that there is little left to say that hasn't been covered in other reviews of the Oceanside Pier. (I especially enjoyed reading the review that gave much of... read more",
            "The oceanside pier is very nice. There is Rubys restaurant at the very end. Rubys is a burger joint and you can get ice cream and some alcoholic drinks. They should have more... read more",
            "There isn't a whole lot to say about the Oceanside Pier- it's fantastic! Great views of the ocean and a beautiful walk!",
            "Lovely walk on a beautiful June afternoon. Lots of fisherman and pelicans just chilling...so funny to see. Lots of surfers to watch! Ruby's at the end for food but very popular",
            "The Pier was a nice walk but not as much activity as at Santa Monica where there were more people and more shops. We did not eat at the restaurant tho.",
            "If you are just 'mozying' around in the area, park it and take a walk along this long pier. It's very wide, and the sturdy wooden planks beneath your feet are fun to walk on... read more",
            "The Pier was great for fishing, watching people, feeding the pelicans, and just sitting and relaxing!! The hot ocean breeze and fisherman are just a fun thing to see. A 'Must do... read more",
            "You can't beat the people watching on The Pier at Oceanside. People of all ages and from all walks of life stroll this pier to take in the beautiful Pacific Ocean and in some... read more",
            "Hey had a great time and lots to do down in Oceanside pier. Good food good time for the family fishing is good too.",
            "Went down to the pier after dinner to walk around and watch the sun set. This is very much a typical So. California Pier. You can watch the local surfers, admire the resident... read more",
            "I liked the stroll along the pier, the view, the action the fishermen were having, and the restaurant at the end.",
            "Great for spending and afternoon to stroll out and take in the great ocean and beach views. The pier was clean and busy with fisherman relaxing. Enjoyable to look out below... read more",
            "Gorgeous setting. Kids fished off the pier while Mom snapped photos of surfers. If you are a photographer don't forget to go under the pier for an interesting perspective.",
            "I spent some time in Cali and the Oceanside Pier and surrounding area was breath taking. The weather is always amazing and a kayak ride is a must.",
            "It is a huge pier and the views are expansive. Lots of good surfing happening below. We kept walking out further to get different views of the surfers.",
            "The pier is interesting to walk and watch the surfers. The Strand is a wonderful place to walk along the beach. It is a concrete walkway. Also good for bikers, runners, etc.",
            "Great place for pictures. It is clean and very enjoyable. There is a great 50's resturant at the end of the pier called Ruby's. Staff is friendly and prices at right.",
            "Love to look back at Oceanside from the End of the Pier ! Watch the Patience & Dedication of people fishing ! See the Surfers from Close - Up ! A German man rented a European... read more",
            "We had lunch out on the Pier at Rubys Diner. I was a little leary that it would be just so so food and more the attraction for the location (at the end of the pier). My husband... read more",
            "We walked along the pier and hoped to watch the sunset, but it was getting a little too cold for us, so we went to the Ruby's Restaurant at the end of the pier, ordered a takeout... read more",
            "We love Oceanside Beach! We actually got to see a seal up on the rocks. This Beach also has a park for the kids up to age 12 to play on. There's nothing like the view of the... read more",
            "Great for a quiet stroll. Wheel chair accessible. It has a restaurant at the end as well as taco shop, bait shack & public restrooms in the middle. Great place to fish or just to... read more",
            "I grew up in the North county but moved away some 14 years ago. We went back this past weekend and stayed near the pier. It was a wonderful walk on a bright sunny day. The surf... read more",
            "Besides the perfect Oceanside weather year round, the pier offers a great place to people watch. I highly recommend right at sunset. Have dinner after at 333 Pacific or maybe... read more",
            "Nothing like a summer stroll on the pier, or a brisk winter walk reviving the spirit. Fishing off the pier, surfing, or watching the suffers lined up and waiting for the big one... read more",
            "We came here because we noticed a trend with the local beaches closing before sunset. The pier itself was nice and long and there was even a restaurant at the end. Highly... read more",
            "Being from the east coast of Australia, we don't get to see beach sunsets. What a beautiful place this is! The pier is beautiful, and feels fairly friendly most of the time... read more",
            "The pier is very long to get to the end but what a great view. Great views on the beach both ways and there's a restaurant at the end. It looked good but we didn't eat... read more",
            "Haven't been to Oceanside Pier for 12 years. Still loved it as much as the first time there. Beautiful walk out to the end of the pier. You can see the surfers on the ocean. Along... read more",
            "This is a really cool big pier. Must be .25 miles long. We walked the length of it with our 3yearold Grandson and had Ice Cream at the end.",
            "This pier is a beautiful place to go, to walk, talk, and enjoy the water. The pier itself is in immaculate condition, and kuddos to the people who take care of it !! :) The walk... read more",
            "The Pier was only a few minutes walk from our condo so we took a couple of walks along there. I think I read that it is the longest pier in California. Always an interesting mix... read more",
            "A lovely day. The pier provides an excellent view of the beaches, the surf and is popular with the local pelicans as well! Great spot for watching surfers, sunsets and fishermen.",
            "We walked to the far end of the pier and really enjoyed ourselves. We got to watch people playing in the surf, surfing and fishing. If it is a nice day, the pier may be crowded... read more",
            "What a wonderful treasure I found in this beach! Simply a lovely place to walk, ride bikes, surfers everywhere! Wonderful shops and restaurants -- parking for a beach wasn't... read more",
            "Really, bums were everywhere! And they were begging. Even tho it was gorgeous, that took away from the atmosphere. Made my 11 yr old very sad to pass them.",
            "I love to stroll down the pier and watch the sunset as kids are playing in the sand and surfers are catching the waves. People are never rushed. Relax and enjoy the fresh air.",
            "Excellent way to get a new perspective on the ocean. You can watch the surfers rude the waves in from a different angle. Good way to get in some steps without realizing that you... read more",
            "I went with my family here for 4th of July, and was surprised with how I wasn't annoyed with crowds of people or a dirty environment. The beach was clean, there were plenty of... read more",
            "We walked from Oceanside harbor on a misty Tuesday morning, so it wasn't too crowded. We had a nice walk from the harbor. On the pier we saw fishermen lining the rails and good... read more",
            "Great food and view was amazing! What's better than on the pier? The views of the ocean and the sounds and smells were amazing. Walking on the pier to get to the diner was... read more",
            "What a lovely place to visit, we went for a stroll on the pier. It has a Ruby Restaurant down the end, we didn't stop for food. But would certainly recommend a visit here.",
            "We loved going to the pier. Really any time is fine. We went during sunset and got some great pictures. There is a Ruby's Diner at the very end of the pier. We did not eat... read more",
            "Very nice...parking is limited good if you have a small vehicle the atmosphere nice... I loved it...my family loves the beach...this was our first time california I liked it...it... read more",
            "This is a very family friendly type of pier in the city of Oceanside! Almost every resident of Oceanside AND the travelers here are so nice, friendly, and funny!! One downside is... read more",
            "What's not to like on a pier? Very nice and clean. There is a restaurant at the end. I didn't eat there but it was cute. The waves were huge that day so there was a great... read more",
            "Great spot to hang on the beach, play in the water, watch the surfers. Easy walk to many great bars and restaurants in downtown Oceanside, or a short walk along the beach to the... read more",
            "The pier is one of my favorite spots to visit. There is a great restaurant on the Pier to eat and have a good view of the ocean.",
            "A nice walk in the evening, watching all of the fishermen! Many small restaurants near by, public bathrooms, nice pier.",
            "There is always so much to do here. The state railroad for public transit brings you right to the pier. Playground for the kids, killer waves for the adults. Rocky beach. Some of... read more",
            "We were in Oceanside during unseasonably warm weather so it was fun to watch the many surfers and talk with local fisherman. The pier has long stretches of sandy beaches on either... read more",
            "We were there for Bike the Coast ride, great food vendors and Music afterwards then the next day Jr. Surf Championships started and we got to see the Parade of Countries coming in... read more",
            "I always enjoy walking out on the Oceanside pier and especially when the sun is setting - simply gorgeous.",
            "Oceanside Pier is truly one of the highlights of any visit to North County San Diego. You can just stroll it and enjoy great views, sea life and people watching. You can bring the... read more",
            "The well-maintained pier affords nice views of the coast and the ocean as well as close-up encounters with huge pelicans which roost on the rail, especially by the fish-cleaning... read more",
            "The Oceanside Pier is a pleasant, easy beach walk. You can rent fishing gear, get a bite to eat, pick up some souvenirs, and be mesmerized by the many surfers below. Most... read more",
            "Great place to visit! Enjoy a nice walk to the end of the pier and view fishing off both sides of pier.. When you reach end of pier enjoy lunch at Rubys restrauant with nice... read more",
            "The pier is very unique structure. Many restaurant options near by. I was happily surprised by all the free parking. There are free lots if you are East of the train tracks. If... read more",
            "Great place to watch surfers riding the pacific waves. Depending on the weather, it's an excellent to enjoy the gorgeous sunset on the pier or on the beach. There are people doing... read more",
            "A must see. Good fishing spot or just a place to relax, people watch or enjoy the sunset. Lots of restaurants and shops within walking distance.",
            "glorious walk , just like a movie or postcard , very relaxing, enjoyed the view of the ocean and rubs at the end has the best chilli (without beans) ever!!!! enjoy it and its free!",
            "We love to take walks out on the Oceanside pier. There is a Ruby's restaurant at the end of the pier that has great food and the scenic view up and down the coast is magnificent... read more",
            "I was fortunate enough to be able to visit Oceanside for the last view days of 2015 and the first day of 2016. Amazing sunsets (probably gorgeous sunrises but I am not a morning... read more",
            "I took a stroll and stumbled on down the crowded walkway that takes its visitors many hundreds of feet out over the pacific ocean. Windy...yes Raining...to my surprise, but... read more",
            "Super fun place to visit. Great place to watch the surfers and the occasional wedding. You will probably have pay to park, but what's a few bucks. There are lifeguards and a... read more"
        ],
        "longitude": "",
        "no_of_reviews": "1,250",
        "address": "300 S Pacific St , Oceanside , CA 92054-2922",
        "rank": "2",
        "youTubeIds": "6vN2-2Ko1e4,Cv1p217SgyM,BQ-zd_QF7sw"
    },
    "Mission San Luis Rey": {
        "knownFor": "Specialty Museums , Museums",
        "latitude": "33.2324324",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or20-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or350-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or50-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or40-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or30-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or10-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or330-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or60-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or320-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or340-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or70-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or290-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or310-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or300-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or80-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or280-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or270-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or260-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or90-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or250-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or240-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or230-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or100-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or220-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or210-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or200-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or110-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or190-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or180-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or170-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or120-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or160-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or140-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or150-Mission_San_Luis_Rey-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d108660-Reviews-or130-Mission_San_Luis_Rey-Oceanside_California.html"
        ],
        "contact": "+1 760-757-3651",
        "reviewComments": [
            "i see the pics of the graveyard but what about the graveyard across the street that is fenced in on a dirt lot ? anybody know what that is about.",
            "This is one of the original missions constructed by the Catholic church to convert the Indians in the area and to secure the area for Spain. The museum in this mission is... read more",
            "This was a stop on our way out to see other things and was a beautiful Spanish style mission.",
            "This is not touristy or ketch. This is an important piece of California history. The church is beautiful. You can light a candle for loved ones.",
            "Beautiful and interesting. Church iCalifornia'ss open and free to visit. Museum is worth small admission fee. Be sure to see California's oldest Pepper tree.",
            "Recently did a California Mission roadtrip. Didnt know much about this one and wasn't one of the missons at the top of my list. However it ended up being one of my favorite... read more",
            "This was a very moving and personal experience for me. The woman who had been my Mentor as a teenager in Georgia passed away and I wanted to come and pay my respects to her. She... read more",
            "It is recommended that you visit at least one of the missions here in California",
            "Very nice church. Very beautiful and peaceful. Good parking, and nice grounds. There are several saints inside the church for you to pray to. The gift shop has lots of items for... read more",
            "The Mission is currently undergoing some retrofit work, but even with that, it's still a lovely place. The sanctuary itself was not open to the public, but most of the rest of... read more",
            "A lovely step back in time. A nice easy stroll around the grounds and buildings. Helpful and passionate volunteers.",
            "My daughter and I decided to spend spend time at the mission before taking my daughter to the airport. She wasn't sure about spending the money to tour the mission, but I... read more",
            "This is a gorgeous mission and is the largest in California. The lady whom you buy tickets from was so very nice explaining alot about the mission. Unfortunately for us, much of... read more",
            "We were disappointed that the church wasn't open and really the entry fee is a donation as the museum is very small and much of the grounds are closed off to the public... read more",
            "While visiting Oceanside we decided to check out the Mission. Definitely worth a visit. Some of the artifacts/antiques are quite unique and help one gain an understanding of the... read more",
            "The mission was a great way to spend an afternoon. There are staff available to answer questions, and share the history of the mission and area. Charmaine Hammond, Guest... read more",
            "Place for all ages. My mom and dad took us here when I was little. We've been here for school tours and I am always happy to revisit. I hope this helps.",
            "Enjoy a walk through the beautifully landscaped garden grounds and peaceful cemetery area. There are benches to use. The Mission has a charming, colorful chapel building. You may... read more",
            "From the church itself to the cemetery, it was all beautiful & quiet. There was even a school there doing a field trip & we barely noticed. Every1 was very helpful. Gift shop was... read more",
            "Excellent historical and archaeological location. Local people run the gift shop and are very helpful. A photographer's paradise.",
            "Friendly monk Peter and his parrot told us all about the mission. We were able to wander around the grounds, cemetery and chapel quietly. A very peaceful place.",
            "4*San Luis Rey Mission Largest of the 21 traditional missions Very tranquil cemetery Beautiful garden with a pepper tree Nice museum tour; fee Simple, but memorable... read more",
            "Take your time and enjoy the Mission grounds and the museum. The Church is amazing and filled with both items made here and brought from Europe. The \"Ecce Homo\" statue on the... read more",
            "We stayed in Carlsbad, CA and the Mission is only a short distance by the freeway. The Church is so beautiful and the museum is well worth the time. The Franciscans were very... read more",
            "Just on a whim we stopped by the mission on or way to get some lunch. We thought we would spend an hour there, two and a half hours later we were still walking the grounds and... read more",
            "What a lovely Franciscan church founded in 1798 I believe I'll have to check that one it is part of those missions going up the state of California. Some reason I haven't been to... read more",
            "Lovely functioning church with a very interesting history. Well maintained premises, with a simple interior of wood and paint.",
            "Having always been a history buff, I was keen to see one of the original missions that contributed to the expansion of this part of California. The story and history of this place... read more",
            "I've visited Mission San Luis Rey several times and never get tired of it. A beautiful building in a lovely setting, with a small but worthwhile museum explaining the encounter... read more",
            "After just one visit to La Misión San Luis Rey de Francia (named after King Louis IX of France) I would put this one at the top of my list of California missions. I found the... read more",
            "It's white building like a palace on the top of the hill, very beautiful. I saw under the huge trees, some families use their own tents staying on the large lawn. Inside church... read more",
            "Attended a wedding there and it was wonderful. Even though it was very hot and humid, it was still a wonderful. experience. A large grounds to see and the Mission itself... read more",
            "A very well preserved mission, and the biggest in California, I think. The cloister has wonderful rose plants.",
            "This is one mission we have somehow missed in the past. It is very nicely refurbished, easy to get to, and worth seeing if you are into the California Missions, history, or just... read more",
            "We stop in and visit Missions when we are in the area. They are all very beautiful and this one is right up there. Well preserved with large grounds to wander around. My friends... read more",
            "Visited this mission early one morning since going from the CST to the PST does not make it easy to sleep. This mission has been here since the mid 1800s and the parish has... read more"
        ],
        "longitude": "-117.319426225101",
        "no_of_reviews": "361",
        "address": "4050 Mission Ave. , Oceanside , CA 92057",
        "rank": "3",
        "youTubeIds": "1PouQ-_DNRY,Xgjp42gWwL0,WMRsig7ywrY"
    },
    "San Luis Rey River Trail": {
        "knownFor": "“ Good bike path ” Reviewed December 17, 2015 Follows about 8 miles of the San Lois Rey arroyo along the south levy top so it's mostly flat. Good quality asphalt for most of the miles, with some washboard concrete at the underpasses. This path isolates you from traffic, but there are quite a few access points, most with parking, some not. Scenery is mix of neighborhoods, riverside trees... More Helpful? Thank Cameron M Report",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32815-d9569105-Reviews-San_Luis_Rey_River_Trail-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d9569105-Reviews-or10-San_Luis_Rey_River_Trail-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d9569105-Reviews-or20-San_Luis_Rey_River_Trail-Oceanside_California.html"
        ],
        "contact": "",
        "reviewComments": [
            "I have been recommending this trail for years. The best part is that there are no fumes from vehicles as you ride. Interesting terrain and the landscapes are beautiful. Going in... read more",
            "My wife and I ride this trail from Oceanside to the beach on weekends. Easy access. Well kept and clean. Pretty much flat with a few dips. Most folks we come across are friendly... read more",
            ""
        ],
        "longitude": "",
        "no_of_reviews": "21",
        "address": null,
        "rank": "13",
        "youTubeIds": "DfydvBuWpxs,JF7C06KQBCg,S-7F13_-eYs"
    },
    "Oceanside Sunset Market": {
        "knownFor": "Flea & Street Markets , Shopping",
        "latitude": "",
        "urls": [
            "https://www.tripadvisor.com/Attraction_Review-g32815-d3137836-Reviews-Oceanside_Sunset_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d3137836-Reviews-or110-Oceanside_Sunset_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d3137836-Reviews-or50-Oceanside_Sunset_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d3137836-Reviews-or40-Oceanside_Sunset_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d3137836-Reviews-or90-Oceanside_Sunset_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d3137836-Reviews-or60-Oceanside_Sunset_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d3137836-Reviews-or80-Oceanside_Sunset_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d3137836-Reviews-or100-Oceanside_Sunset_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d3137836-Reviews-or70-Oceanside_Sunset_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d3137836-Reviews-or30-Oceanside_Sunset_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d3137836-Reviews-or20-Oceanside_Sunset_Market-Oceanside_California.html",
            "https://www.tripadvisor.com/Attraction_Review-g32815-d3137836-Reviews-or10-Oceanside_Sunset_Market-Oceanside_California.html"
        ],
        "contact": "",
        "reviewComments": [
            "Nice street fair. It tends to be the same sellers week after week but it's a nice place to browse. Good food and there is a farmers market. The local bars nearby tend to be for... read more",
            "A fun few blocks of tents set up offering jewelry, crafts, produce, music, and primarily food. I was surprised at the wide variety--from the familiar (sliders, corn on the cob... read more",
            "As a non-surfer, I was unsure if this would be of interest, but my whole family enjoyed the visit. It's small, but worth a stop.",
            "Can't beat the beautiful weather all year long at the Sunset Market. There is a wide variety of vendors from food to shopping, and farmer's market. Love that dogs are welcome, but... read more",
            "For a small city, the MainStreet crew put on an amazing event (50 times a year). We arrived in time for dinner and had a difficult time wading through all the possibilities. We... read more",
            "Wow! Free entertainment, lots of fun food booths, unique products and gift booths, wonderful produce and fruit stands, flower and plant stalls, ice cream, Hawiian Ice and the best... read more",
            "Our family once really loved our time at the Oceanside Thursday night Sunset Market. I love the many different kinds of food available from around the world, the people, the... read more",
            "Locals from surrounding towns, recommended this event. They were all right! If you go with someone fun, this can be a really nice evening. The band was perfect, playing songs... read more",
            "We were lucky enough to arrive in Oceanview on Sunset Market day (Thursday). We prefer a sit-down dinner, so ate before arriving at the market at about 7pm. This may have been a... read more",
            "Staying in Escondido we went to the sunset market for an evening. I ate salmon from a place which cooked it on a board over open fire. You could get 4,6, or 8 oz, portion with... read more",
            "I love the market it is very well organized and the food it YUMMY! Lots to do at night and I get veggies n the day. Parking is only an issue right now as there is construction... read more",
            "This weekly street fair is sooooo much fun. Lots of great food, crafts, clothing, art and veggies to purchase. We love the variety of food - there's even African food that's... read more"
        ],
        "longitude": "",
        "no_of_reviews": "118",
        "address": "316 Mission Ave , Oceanside , CA 92054-2553",
        "rank": "6",
        "youTubeIds": "18oQgDkt-TI,Cg_veQc53Y8,unkIu3keBRw"
    }
}